package Payroll;

import com.gauce.*;
import com.gauce.io.*;
import com.gauce.common.*;
import com.gauce.log.*;
import com.gauce.db.*;
import javax.servlet.*;
import javax.servlet.http.*;
import java.sql.*;

// class 이름은 화일명과 항상 동일해야 함.
public class p030002_s3 extends HttpServlet {

	// 웹페이지의 폼의 전송방식이 Post 타입일 경우
	public void doGet(HttpServletRequest req, HttpServletResponse res) {
		res.setContentType("text/html;charset=ksc5601");
		ServiceLoader loader = new ServiceLoader(req, res);
		GauceService service = null;
		GauceContext context = null;
		Logger logger = null;
		GauceDBConnection conn = null;
		GauceStatement stmt =null;
		GauceDataSet dSet = null;

		try {
			service = loader.newService();
			context = service.getContext();
			logger = context.getLogger();

			GauceRequest GauceReq = service.getGauceRequest();
      GauceResponse GauceRes = service.getGauceResponse();

			try {
				conn = service.getDBConnection();
				dSet = new GauceDataSet();

/**********************************************************************************************
	실제 업무에서 적용하실 부분
**********************************************************************************************/
				// 웹페이지에서 조건값을 넘겨받음
				String [] str = new String [10];
				str[0]	= req.getParameter("v_str1");		//사번
				str[1]  = req.getParameter("v_str2");		//귀속년도
				str[2]  = req.getParameter("v_str3");		//작성일자
				str[3]	= req.getParameter("v_str4");		//부서

				for (int s=0;s<=3;s++) {
					if (str[s]==null) str[s] = "";
				}

				GauceRes.enableFirstRow(dSet);
				String[] strArrCN = new String[]{
						
						"YYYY",			/*귀속연도*/
						"EMPNO",    /*사번*/
						"EMPNMK",		/*성명*/
						"RESINO",		/*주민등록번호*/
						"FAMCNT",		/*공제대상가족수*/
						"INCYY01",	/*1월지급년월*/
						"INC01001",	/*1월급여액*/
						"INC01002",	/*1월상여액*/
						"INC01003",	/*1월인정상여*/
						"INC01004",	/*1월총급여계*/
						"INC01005",	/*1월간이세액표에 의한 소득세*/
						"INCYY02",	/*2월지급년월*/
						"INC02001",	/*2월급여액*/
						"INC02002",	/*2월상여액*/
						"INC02003",	/*2월인정상여*/
						"INC02004",	/*2월총급여계*/
						"INC02005",	/*2월간이세액표에 의한 소득세*/
						"INCYY03",	/*3월지급년월*/
						"INC03001",	/*3월급여액*/
						"INC03002",	/*3월상여액*/
						"INC03003",	/*3월인정상여*/
						"INC03004",	/*3월총급여계*/
						"INC03005",	/*3월간이세액표에 의한 소득세*/
						"INCYY04",	/*4월지급년월*/
						"INC04001",	/*4월급여액*/
						"INC04002",	/*4월상여액*/
						"INC04003",	/*4월인정상여*/
						"INC04004",	/*4월총급여계*/
						"INC04005",	/*4월간이세액표에 의한 소득세*/
						"INCYY05",	/*5월지급년월*/
						"INC05001",	/*5월급여액*/
						"INC05002",	/*5월상여액*/
						"INC05003",	/*5월인정상여*/
						"INC05004",	/*5월총급여계*/
						"INC05005",	/*5월간이세액표에 의한 소득세*/
						"INCYY06",	/*6월지급년월*/
						"INC06001",	/*6월급여액*/
						"INC06002",	/*6월상여액*/
						"INC06003",	/*6월인정상여*/
						"INC06004",	/*6월총급여계*/
						"INC06005",	/*6월간이세액표에 의한 소득세*/
						"INCYY07",	/*7월지급년월*/
						"INC07001",	/*7월급여액*/
						"INC07002",	/*7월상여액*/
						"INC07003",	/*7월인정상여*/
						"INC07004",	/*7월총급여계*/
						"INC07005",	/*7월간이세액표에 의한 소득세*/
						"INCYY08",	/*8월지급년월*/
						"INC08001",	/*8월급여액*/
						"INC08002",	/*8월상여액*/
						"INC08003",	/*8월인정상여*/
						"INC08004",	/*8월총급여계*/
						"INC08005",	/*8월간이세액표에 의한 소득세*/
						"INCYY09",	/*9월지급년월*/
						"INC09001",	/*9월급여액*/
						"INC09002",	/*9월상여액*/
						"INC09003",	/*9월인정상여*/
						"INC09004",	/*9월총급여계*/
						"INC09005",	/*9월간이세액표에 의한 소득세*/
						"INCYY10",	/*10월지급년월*/
						"INC10001",	/*10월급여액*/
						"INC10002",	/*10월상여액*/
						"INC10003",	/*10월인정상여*/
						"INC10004",	/*10월총급여계*/
						"INC10005",	/*10월간이세액표에 의한 소득세*/
						"INCYY11",	/*11월지급년월*/
						"INC11001",	/*11월급여액*/
						"INC11002",	/*11월상여액*/
						"INC11003",	/*11월인정상여*/
						"INC11004",	/*11월총급여계*/
						"INC11005",	/*11월간이세액표에 의한 소득세*/
						"INCYY12",	/*12월지급년월*/
						"INC12001",	/*12월급여액*/
						"INC12002",	/*12월상여액*/
						"INC12003",	/*12월인정상여*/
						"INC12004",	/*12월총급여계*/
						"INC12005",	/*12월간이세액표에 의한 소득세*/
						"SINC001",	/*년간급여계*/
						"SINC002",	/*년간상여계*/
						"SINC003",	/*년간인정상여계*/
						"SINC004",	/*년간총급여계*/
						"SINC005",	/*년간간이세액표에의한소득세계*/
						"FREYY01",	/*1월비과세지급년월*/
						"FRE01001",	/*1월비과세국외근로소득외화*/
						"FRE01002",	/*1월비과세국외근로소득원화*/
						"FRE01003",	/*1월비과세생산직근로자야근수당*/
						"FRE01004",	/*1월기타비과세내용*/
						"FRE01005",	/*1월기타비과세금액*/
						"FREYY02",	/*2월비과세지급년월*/
						"FRE02001",	/*2월비과세국외근로소득외화*/
						"FRE02002",	/*2월비과세국외근로소득원화*/
						"FRE02003",	/*2월비과세생산직근로자야근수당*/
						"FRE02004",	/*2월기타비과세내용*/
						"FRE02005",	/*2월기타비과세금액*/
						"FREYY03",	/*3월비과세지급년월*/
						"FRE03001",	/*3월비과세국외근로소득외화*/
						"FRE03002",	/*3월비과세국외근로소득원화*/
						"FRE03003",	/*3월비과세생산직근로자야근수당*/
						"FRE03004",	/*3월기타비과세내용*/
						"FRE03005",	/*3월기타비과세금액*/
						"FREYY04",	/*4월비과세지급년월*/
						"FRE04001",	/*4월비과세국외근로소득외화*/
						"FRE04002",	/*4월비과세국외근로소득원화*/
						"FRE04003",	/*4월비과세생산직근로자야근수당*/
						"FRE04004",	/*4월기타비과세내용*/
						"FRE04005",	/*4월기타비과세금액*/
						"FREYY05",	/*5월비과세지급년월*/
						"FRE05001",	/*5월비과세국외근로소득외화*/
						"FRE05002",	/*5월비과세외근로소득원화*/
						"FRE05003",	/*5월비과세국생산직근로자야근수당*/
						"FRE05004",	/*5월기타비과세내용*/
						"FRE05005",	/*5월기타비과세금액*/
						"FREYY06",	/*6월비과세지급년월*/
						"FRE06001",	/*6월비과세국외근로소득외화*/
						"FRE06002",	/*6월비과세국외근로소득원화*/
						"FRE06003",	/*6월비과세생산직근로자야근수당*/
						"FRE06004",	/*6월기타비과세내용*/
						"FRE06005",	/*6월기타비과세금액*/
						"FREYY07",	/*7월비과세지급년월*/
						"FRE07001",	/*7월비과세국외근로소득외화*/
						"FRE07002",	/*7월비과세국외근로소득원화*/
						"FRE07003",	/*7월비과세생산직근로자야근수당*/
						"FRE07004",	/*7월기타비과세내용*/
						"FRE07005",	/*7월기타비과세금액*/
						"FREYY08",	/*8월비과세지급년월*/
						"FRE08001",	/*8월비과세국외근로소득외화*/
						"FRE08002",	/*8월비과세국외근로소득원화*/
						"FRE08003",	/*8월비과세생산직근로자야근수당*/
						"FRE08004",	/*8월기타비과세내용*/
						"FRE08005",	/*8월기타비과세금액*/
						"FREYY09",	/*9월비과세지급년월*/
						"FRE09001",	/*9월비과세국외근로소득외화*/
						"FRE09002",	/*9월비과세국외근로소득원화*/
						"FRE09003",	/*9월비과세생산직근로자야근수당*/
						"FRE09004",	/*9월기타비과세내용*/
						"FRE09005",	/*9월기타비과세금액*/
						"FREYY10",	/*10월비과세지급년월*/
						"FRE10001",	/*10월비과세국외근로소득외화*/
						"FRE10002",	/*10월비과세국외근로소득원화*/
						"FRE10003",	/*10월비과세생산직근로자야근수당*/
						"FRE10004",	/*10월기타비과세내용*/
						"FRE10005",	/*10월기타비과세금액*/
						"FREYY11",	/*11월비과세지급년월*/
						"FRE11001",	/*11월비과세국외근로소득외화*/
						"FRE11002",	/*11월비과세국외근로소득원화*/
						"FRE11003",	/*11월비과세생산직근로자야근수당*/
						"FRE11004",	/*11월기타비과세내용*/
						"FRE11005",	/*11월기타비과세금액*/
						"FREYY12",	/*12월비과세지급년월*/
						"FRE12001",	/*12월비과세국외근로소득외화*/
						"FRE12002",	/*12월비과세국외근로소득원화*/
						"FRE12003",	/*12월비과세국생산직근로자야근수당*/
						"FRE12004",	/*12월기타비과세내용*/
						"FRE12005",	/*12월기타비과세금액*/
						"SFRE001",	/*년간국외근로소득외화계*/
						"SFRE002",	/*년간국외근로소득원화계*/
						"SFRE003",	/*년간생산직야간근로수당계*/
						"SFRE005",	/*년간기타비과세계*/
						"COL01001",	/*1월감면세액*/
						"COL01002",	/*1월소득세*/
						"COL01003",	/*1월주민세*/
						"COL01004",	/*1월농어촌특별세*/
						"COL01005",	/*1월연금보험*/
						"COL01006",	/*1월건강보험*/
						"COL01007",	/*1월고용보험*/
						"COL01008",	/*1월기부금*/
						"COL02001",	/*2월감면세액*/
						"COL02002",	/*2월소득세*/
						"COL02003",	/*2월주민세*/
						"COL02004",	/*2월농어촌특별세*/
						"COL02005",	/*2월연금보험*/
						"COL02006",	/*2월건강보험*/
						"COL02007",	/*2월고용보험*/
						"COL02008",	/*2월기부금*/
						"COL03001",	/*3월감면세액*/
						"COL03002",	/*3월소득세*/
						"COL03003",	/*3월주민세*/
						"COL03004",	/*3월농어촌특별세*/
						"COL03005",	/*3월연금보험*/
						"COL03006",	/*3월건강보험*/
						"COL03007",	/*3월고용보험*/
						"COL03008",	/*3월기부금*/
						"COL04001",	/*4월감면세액*/
						"COL04002",	/*4월소득세*/
						"COL04003",	/*4월주민세*/
						"COL04004",	/*4월농어촌특별세*/
						"COL04005",	/*4월연금보험*/
						"COL04006",	/*4월건강보험*/
						"COL04007",	/*4월고용보험*/
						"COL04008",	/*4월기부금*/
						"COL05001",	/*5월감면세액*/
						"COL05002",	/*5월소득세*/
						"COL05003",	/*5월주민세*/
						"COL05004",	/*5월농어촌특별세*/
						"COL05005",	/*5월연금보험*/
						"COL05006",	/*5월건강보험*/
						"COL05007",	/*5월고용보험*/
						"COL05008",	/*5월기부금*/
						"COL06001",	/*6월감면세액*/
						"COL06002",	/*6월소득세*/
						"COL06003",	/*6월주민세*/
						"COL06004",	/*6월농어촌특별세*/
						"COL06005",	/*6월연금보험*/
						"COL06006",	/*6월건강보험*/
						"COL06007",	/*6월고용보험*/
						"COL06008",	/*6월기부금*/
						"COL07001",	/*7월감면세액*/
						"COL07002",	/*7월소득세*/
						"COL07003",	/*7월주민세*/
						"COL07004",	/*7월농어촌특별세*/
						"COL07005",	/*7월연금보험*/
						"COL07006",	/*7월건강보험*/
						"COL07007",	/*7월고용보험*/
						"COL07008",	/*7월기부금*/
						"COL08001",	/*8월감면세액*/
						"COL08002",	/*8월소득세*/
						"COL08003",	/*8월주민세*/
						"COL08004",	/*8월농어촌특별세*/
						"COL08005",	/*8월연금보험*/
						"COL08006",	/*8월건강보험*/
						"COL08007",	/*8월고용보험*/
						"COL08008",	/*8월기부금*/
						"COL09001",	/*9월감면세액*/
						"COL09002",	/*9월소득세*/
						"COL09003",	/*9월주민세*/
						"COL09004",	/*9월농어촌특별세*/
						"COL09005",	/*9월연금보험*/
						"COL09006",	/*9월건강보험*/
						"COL09007",	/*9월고용보험*/
						"COL09008",	/*9월기부금*/
						"COL10001",	/*10월감면세액*/
						"COL10002",	/*10월소득세*/
						"COL10003",	/*10월주민세*/
						"COL10004",	/*10월농어촌특별세*/
						"COL10005",	/*10월연금보험*/
						"COL10006",	/*10월건강보험*/
						"COL10007",	/*10월고용보험*/
						"COL10008",	/*10월기부금*/
						"COL11001",	/*11월감면세액*/
						"COL11002",	/*11월소득세*/
						"COL11003",	/*11월주민세*/
						"COL11004",	/*11월농어촌특별세*/
						"COL11005",	/*11월연금보험*/
						"COL11006",	/*11월건강보험*/
						"COL11007",	/*11월고용보험*/
						"COL11008",	/*11월기부금*/
						"COL12001",	/*12월감면세액*/
						"COL12002",	/*12월소득세*/
						"COL12003",	/*12월주민세*/
						"COL12004",	/*12월농어촌특별세*/
						"COL12005",	/*12월연금보험*/
						"COL12006",	/*12월건강보험*/
						"COL12007",	/*12월고용보험*/
						"COL12008",	/*12월기부금*/
						"SCOL002",	/*년간소득세계*/
						"SCOL003",	/*년간주민세계*/
						"SCOL004",	/*년간농특세계*/
						"SCOL005",	/*년간연금보험계*/
						"SCOL006",	/*년간건강보험계*/
						"SCOL007",	/*년간고용보험계*/
						"SCOL008",	/*년간기부금계*/
						"PROSTS",	  /*진행상태*/
						"CURDT",		/*작성일자*/
						"BP11000",	/*종전근무 - 급여*/						
						"BP12000",	/*종전근무 - 상여*/						
						"BP13000",	/*종전근무 - 인정상여*/				
						"BP10SUM",	/*종전근무 - 총급여계*/				
						"BP40SUM",	/*종전근무 - 세액계*/					
						"BP21000",	/*종전근무 - 국외근로비과세*/	
						"BP22000",	/*종전근무 - 야간근로비과세*/	
						"BP23000",	/*종전근무 - 기타비과세*/			
						"BP31000",	/*종전근무 - 국민연금*/				
						"BP32000",	/*종전근무 - 건강보험*/				
						"BP33000",	/*종전근무 - 고용보험*/				
						"BP41000",	/*종전근무 - 소득세*/					
						"BP42000",	/*종전근무 - 주민세*/					
						"BP43000", 	/*종전근무 - 농특세*/					
            "FRE01_SUM","FRE02_SUM","FRE03_SUM","FRE04_SUM","FRE05_SUM","FRE06_SUM",
						"FRE07_SUM","FRE08_SUM","FRE09_SUM","FRE10_SUM","FRE11_SUM","FRE12_SUM",
            "SFRE_SUM"
 			};

				int[] intArrCN = new int[]{  

						4,  /*귀속연도 4자리*/                         
						7,  /*사번*/                             
						20,	/*성명*/                             
						13, /*주민등록번호*/                     
						2, 	/*공제대상가족수*/                   
						6, 	/*1월지급년월*/                      
						9, 	/*1월급여액*/                        
						9, 	/*1월상여액*/                        
						9, 	/*1월인정상여*/                      
						9,	/*1월총급여계*/                      
						9,	/*1월간이세액표에 의한 소득세*/      
						6, 	/*2월지급년월*/                      
						9, 	/*2월급여액*/                        
						9, 	/*2월상여액*/                        
						9, 	/*2월인정상여*/                      
						9,	/*2월총급여계*/                      
						9,	/*2월간이세액표에 의한 소득세*/      
						6, 	/*3월지급년월*/                      
						9, 	/*3월급여액*/                        
						9, 	/*3월상여액*/                        
						9, 	/*3월인정상여*/                      
						9,	/*3월총급여계*/                      
						9,	/*3월간이세액표에 의한 소득세*/      
						6, 	/*4월지급년월*/                      
						9, 	/*4월급여액*/                        
						9, 	/*4월상여액*/                        
						9, 	/*4월인정상여*/                      
						9,	/*4월총급여계*/                      
						9,	/*4월간이세액표에 의한 소득세*/      
						6, 	/*5월지급년월*/                      
						9, 	/*5월급여액*/                        
						9, 	/*5월상여액*/                        
						9, 	/*5월인정상여*/                      
						9,	/*5월총급여계*/                      
						9,	/*5월간이세액표에 의한 소득세*/      
						6, 	/*6월지급년월*/                      
						9, 	/*6월급여액*/                        
						9, 	/*6월상여액*/                        
						9, 	/*6월인정상여*/                      
						9,	/*6월총급여계*/                      
						9,	/*6월간이세액표에 의한 소득세*/      
						6, 	/*7월지급년월*/                      
						9, 	/*7월급여액*/                        
						9, 	/*7월상여액*/                        
						9, 	/*7월인정상여*/                      
						9,	/*7월총급여계*/                      
						9,	/*7월간이세액표에 의한 소득세*/      
						6, 	/*8월지급년월*/                      
						9, 	/*8월급여액*/                        
						9, 	/*8월상여액*/                        
						9, 	/*8월인정상여*/                      
						9,	/*8월총급여계*/                      
						9,	/*8월간이세액표에 의한 소득세*/      
						6, 	/*9월지급년월*/                      
						9, 	/*9월급여액*/                        
						9, 	/*9월상여액*/                        
						9, 	/*9월인정상여*/                      
						9,	/*9월총급여계*/                      
						9,	/*9월간이세액표에 의한 소득세*/      
						6, 	/*10월지급년월*/                     
						9, 	/*10월급여액*/                       
						9, 	/*10월상여액*/                       
						9, 	/*10월인정상여*/                     
						9,	/*10월총급여계*/                     
						9,	/*10월간이세액표에 의한 소득세*/     
						6, 	/*11월지급년월*/                     
						9, 	/*11월급여액*/                       
						9, 	/*11월상여액*/                       
						9, 	/*11월인정상여*/                     
						9,	/*11월총급여계*/                     
						9,	/*11월간이세액표에 의한 소득세*/     
						6, 	/*12월지급년월*/                     
						9, 	/*12월급여액*/                       
						9, 	/*12월상여액*/                       
						9, 	/*12월인정상여*/                     
						9,	/*12월총급여계*/                     
						9,	/*12월간이세액표에 의한 소득세*/     
						11, /*년간급여계*/                       
						11, /*년간상여계*/                       
						11, /*년간인정상여계*/                   
						11, /*년간총급여계*/                     
						11, /*년간간이세액표에의한소득세계*/     
						6, 	/*1월비과세지급년월*/                
						9, 	/*1월비과세국외근로소득외화*/        
						9, 	/*1월비과세국외근로소득원화*/        
						9, 	/*1월비과세생산직근로자야근수당*/    
						20,	/*1월기타비과세내용*/                
						9,	/*1월기타비과세금액*/                
						6, 	/*2월비과세지급년월*/                
						9, 	/*2월비과세국외근로소득외화*/        
						9, 	/*2월비과세국외근로소득원화*/        
						9, 	/*2월비과세생산직근로자야근수당*/    
						20,	/*2월기타비과세내용*/                
						9,	/*2월기타비과세금액*/                
						6, 	/*3월비과세지급년월*/                
						9, 	/*3월비과세국외근로소득외화*/        
						9, 	/*3월비과세국외근로소득원화*/        
						9, 	/*3월비과세생산직근로자야근수당*/    
						20,	/*3월기타비과세내용*/                
						9,	/*3월기타비과세금액*/                
						6, 	/*4월비과세지급년월*/                
						9, 	/*4월비과세국외근로소득외화*/        
						9, 	/*4월비과세국외근로소득원화*/        
						9, 	/*4월비과세생산직근로자야근수당*/    
						20,	/*4월기타비과세내용*/                
						9,	/*4월기타비과세금액*/                
						6, 	/*5월비과세지급년월*/                
						9, 	/*5월비과세국외근로소득외화*/        
						9, 	/*5월비과세외근로소득원화*/          
						9, 	/*5월비과세국생산직근로자야근수당*/  
						20,	/*5월기타비과세내용*/                
						9,	/*5월기타비과세금액*/                
						6, 	/*6월비과세지급년월*/                
						9, 	/*6월비과세국외근로소득외화*/        
						9, 	/*6월비과세국외근로소득원화*/        
						9, 	/*6월비과세생산직근로자야근수당*/    
						20,	/*6월기타비과세내용*/                
						9,	/*6월기타비과세금액*/                
						6, 	/*7월비과세지급년월*/                
						9, 	/*7월비과세국외근로소득외화*/        
						9, 	/*7월비과세국외근로소득원화*/        
						9, 	/*7월비과세생산직근로자야근수당*/    
						20,	/*7월기타비과세내용*/                
						9,	/*7월기타비과세금액*/                
						6, 	/*8월비과세지급년월*/                
						9, 	/*8월비과세국외근로소득외화*/        
						9, 	/*8월비과세국외근로소득원화*/        
						9, 	/*8월비과세생산직근로자야근수당*/    
						20,	/*8월기타비과세내용*/                
						9,	/*8월기타비과세금액*/                
						6, 	/*9월비과세지급년월*/                
						9, 	/*9월비과세국외근로소득외화*/        
						9, 	/*9월비과세국외근로소득원화*/        
						9, 	/*9월비과세생산직근로자야근수당*/    
						20,	/*9월기타비과세내용*/                
						9,	/*9월기타비과세금액*/                
						6, 	/*10월비과세지급년월*/               
						9, 	/*10월비과세국외근로소득외화*/       
						9, 	/*10월비과세국외근로소득원화*/       
						9, 	/*10월비과세생산직근로자야근수당*/   
						20,	/*10월기타비과세내용*/               
						9,	/*10월기타비과세금액*/               
						6, 	/*11월비과세지급년월*/               
						9, 	/*11월비과세국외근로소득외화*/       
						9, 	/*11월비과세국외근로소득원화*/       
						9, 	/*11월비과세생산직근로자야근수당*/   
						20,	/*11월기타비과세내용*/               
						9,	/*11월기타비과세금액*/               
						6, 	/*12월비과세지급년월*/               
						9, 	/*12월비과세국외근로소득외화*/       
						9, 	/*12월비과세국외근로소득원화*/       
						9, 	/*12월비과세국생산직근로자야근수당*/ 
						20,	/*12월기타비과세내용*/               
						9,	/*12월기타비과세금액*/               
						9, 	/*년간국외근로소득외화계*/           
						9, 	/*년간국외근로소득원화계*/           
						9, 	/*년간생산직야간근로수당계*/         
						9, 	/*년간기타비과세계*/                 
						9, 	/*1월감면세액*/                      
						9,	/*1월소득세*/                        
						9,	/*1월주민세*/                        
						9,	/*1월농어촌특별세*/                  
						9,	/*1월연금보험*/                      
						9,	/*1월건강보험*/                      
						9,	/*1월고용보험*/                      
						9,	/*1월기부금*/                        
						9, 	/*2월감면세액*/                      
						9,	/*2월소득세*/                        
						9,	/*2월주민세*/                        
						9,	/*2월농어촌특별세*/                  
						9,	/*2월연금보험*/                      
						9,	/*2월건강보험*/                      
						9,	/*2월고용보험*/                      
						9,	/*2월기부금*/                        
						9, 	/*3월감면세액*/                      
						9,	/*3월소득세*/                        
						9,	/*3월주민세*/                        
						9,	/*3월농어촌특별세*/                  
						9,	/*3월연금보험*/                      
						9,	/*3월건강보험*/                      
						9,	/*3월고용보험*/                      
						9,	/*3월기부금*/                        
						9, 	/*4월감면세액*/                      
						9,	/*4월소득세*/                        
						9,	/*4월주민세*/                        
						9,	/*4월농어촌특별세*/                  
						9,	/*4월연금보험*/                      
						9,	/*4월건강보험*/                      
						9,	/*4월고용보험*/                      
						9,	/*4월기부금*/                        
						9, 	/*5월감면세액*/                      
						9,	/*5월소득세*/                        
						9,	/*5월주민세*/                        
						9,	/*5월농어촌특별세*/                  
						9,	/*5월연금보험*/                      
						9,	/*5월건강보험*/                      
						9,	/*5월고용보험*/                      
						9,	/*5월기부금*/                        
						9, 	/*6월감면세액*/                      
						9,	/*6월소득세*/                        
						9,	/*6월주민세*/                        
						9,	/*6월농어촌특별세*/                  
						9,	/*6월연금보험*/                      
						9,	/*6월건강보험*/                      
						9,	/*6월고용보험*/                      
						9,	/*6월기부금*/                        
						9, 	/*7월감면세액*/                      
						9,	/*7월소득세*/                        
						9,	/*7월주민세*/                        
						9,	/*7월농어촌특별세*/                  
						9,	/*7월연금보험*/                      
						9,	/*7월건강보험*/                      
						9,	/*7월고용보험*/                      
						9,	/*7월기부금*/                        
						9, 	/*8월감면세액*/                      
						9,	/*8월소득세*/                        
						9,	/*8월주민세*/                        
						9,	/*8월농어촌특별세*/                  
						9,	/*8월연금보험*/                      
						9,	/*8월건강보험*/                      
						9,	/*8월고용보험*/                      
						9,	/*8월기부금*/                        
						9, 	/*9월감면세액*/                      
						9,	/*9월소득세*/                        
						9,	/*9월주민세*/                        
						9,	/*9월농어촌특별세*/                  
						9,	/*9월연금보험*/                      
						9,	/*9월건강보험*/                      
						9,	/*9월고용보험*/                      
						9,	/*9월기부금*/                        
						9, 	/*10월감면세액*/                     
						9,	/*10월소득세*/                       
						9,	/*10월주민세*/                       
						9,	/*10월농어촌특별세*/                 
						9,	/*10월연금보험*/                     
						9,	/*10월건강보험*/                     
						9,	/*10월고용보험*/                     
						9,	/*10월기부금*/                       
						9, 	/*11월감면세액*/                     
						9,	/*11월소득세*/                       
						9,	/*11월주민세*/                       
						9,	/*11월농어촌특별세*/                 
						9,	/*11월연금보험*/                     
						9,	/*11월건강보험*/                     
						9,	/*11월고용보험*/                     
						9,	/*11월기부금*/                       
						9, 	/*12월감면세액*/                     
						9,	/*12월소득세*/                       
						9,	/*12월주민세*/                       
						9,	/*12월농어촌특별세*/                 
						9,	/*12월연금보험*/                     
						9,	/*12월건강보험*/                     
						9, 	/*12월고용보험*/                     
						9,	/*12월기부금*/                       
						9,	/*년간소득세계*/                     
						9,	/*년간주민세계*/                     
						9,	/*년간농특세계*/                     
						9,	/*년간연금보험계*/                   
						9,	/*년간건강보험계*/                   
						9,	/*년간고용보험계*/                   
						9,  /*년간기부금계*/                     
						1,	/*진행상태*/ 
						8,  /*작성일자*/
						9,	/*종전근무 - 급여*/						
						9,	/*종전근무 - 상여*/						
						9, 	/*종전근무 - 인정상여*/				
						9,	/*종전근무 - 총급여계*/				
						9,	/*종전근무 - 세액계*/					
						9,	/*종전근무 - 국외근로비과세*/	
						9,	/*종전근무 - 야간근로비과세*/	
						9,	/*종전근무 - 기타비과세*/			
						9, 	/*종전근무 - 국민연금*/				
						9,	/*종전근무 - 건강보험*/				
						9,	/*종전근무 - 고용보험*/				
						9,	/*종전근무 - 소득세*/					
						9,	/*종전근무 - 주민세*/					
						9, 	/*종전근무 - 농특세*/					
            9,9,9,9,9,9,
						9,9,9,9,9,9,
            9
         }; 
				
				int[] intArrCN2 = new int[]{ 
					  -1,         /*귀속연도*/                        
						-1,         /*사번*/                            
						-1,         /*성명*/                            
						-1,         /*주민등록번호*/                    
						 0,         /*공제대상가족수*/                  
						-1,         /*1월지급년월*/                     
						 0,         /*1월급여액*/                       
						 0,         /*1월상여액*/                       
						 0,         /*1월인정상여*/                     
						 0,         /*1월총급여계*/                     
						 0,         /*1월간이세액표에 의한 소득세*/     
						-1,         /*2월지급년월*/                     
						 0,         /*2월급여액*/                       
						 0,         /*2월상여액*/                       
						 0,         /*2월인정상여*/                     
						 0,         /*2월총급여계*/                     
						 0,         /*2월간이세액표에 의한 소득세*/     
						-1,         /*3월지급년월*/                     
						 0,         /*3월급여액*/                       
						 0,         /*3월상여액*/                       
						 0,         /*3월인정상여*/                     
						 0,         /*3월총급여계*/                     
						 0,         /*3월간이세액표에 의한 소득세*/     
						-1,         /*4월지급년월*/                     
						 0,         /*4월급여액*/                       
						 0,         /*4월상여액*/                       
						 0,         /*4월인정상여*/                     
						 0,         /*4월총급여계*/                     
						 0,         /*4월간이세액표에 의한 소득세*/     
						-1,         /*5월지급년월*/                     
						 0,         /*5월급여액*/                       
						 0,         /*5월상여액*/                       
						 0,         /*5월인정상여*/                     
						 0,         /*5월총급여계*/                     
						 0,         /*5월간이세액표에 의한 소득세*/     
						-1,         /*6월지급년월*/                     
						 0,         /*6월급여액*/                       
						 0,         /*6월상여액*/                       
						 0,         /*6월인정상여*/                     
						 0,         /*6월총급여계*/                     
						 0,         /*6월간이세액표에 의한 소득세*/     
						-1,         /*7월지급년월*/                     
						 0,         /*7월급여액*/                       
						 0,         /*7월상여액*/                       
						 0,         /*7월인정상여*/                     
						 0,         /*7월총급여계*/                     
						 0,         /*7월간이세액표에 의한 소득세*/     
						-1,         /*8월지급년월*/                     
						 0,         /*8월급여액*/                       
						 0,         /*8월상여액*/                       
						 0,         /*8월인정상여*/                     
						 0,         /*8월총급여계*/                     
						 0,         /*8월간이세액표에 의한 소득세*/     
						-1,         /*9월지급년월*/                     
						 0,         /*9월급여액*/                       
						 0,         /*9월상여액*/                       
						 0,         /*9월인정상여*/                     
						 0,         /*9월총급여계*/                     
						 0,         /*9월간이세액표에 의한 소득세*/     
						-1,         /*10월지급년월*/                    
						 0,         /*10월급여액*/                      
						 0,         /*10월상여액*/                      
						 0,         /*10월인정상여*/                    
						 0,         /*10월총급여계*/                    
						 0,         /*10월간이세액표에 의한 소득세*/    
						-1,         /*11월지급년월*/                    
						 0,         /*11월급여액*/                      
						 0,         /*11월상여액*/                      
						 0,         /*11월인정상여*/                    
						 0,         /*11월총급여계*/                    
						 0,         /*11월간이세액표에 의한 소득세*/    
						-1,         /*12월지급년월*/                    
						 0,         /*12월급여액*/                      
						 0,         /*12월상여액*/                      
						 0,         /*12월인정상여*/                    
						 0,         /*12월총급여계*/                    
						 0,         /*12월간이세액표에 의한 소득세*/    
						 0,					/*년간급여계*/                      
						 0,					/*년간상여계*/                      
						 0,					/*년간인정상여계*/                  
						 0,					/*년간총급여계*/                    
						 0,					/*년간간이세액표에의한소득세계*/    
						-1,         /*1월비과세지급년월*/               
						 0,         /*1월비과세국외근로소득외화*/       
						 0,         /*1월비과세국외근로소득원화*/       
						 0,         /*1월비과세생산직근로자야근수당*/   
						-1,         /*1월기타비과세내용*/               
						 0,         /*1월기타비과세금액*/               
						-1,         /*2월비과세지급년월*/               
						 0,         /*2월비과세국외근로소득외화*/       
						 0,         /*2월비과세국외근로소득원화*/       
						 0,         /*2월비과세생산직근로자야근수당*/   
						-1,         /*2월기타비과세내용*/               
						 0,         /*2월기타비과세금액*/               
						-1,         /*3월비과세지급년월*/               
						 0,         /*3월비과세국외근로소득외화*/       
						 0,         /*3월비과세국외근로소득원화*/       
						 0,         /*3월비과세생산직근로자야근수당*/   
						-1,         /*3월기타비과세내용*/               
						 0,         /*3월기타비과세금액*/               
						-1,         /*4월비과세지급년월*/               
						 0,         /*4월비과세국외근로소득외화*/       
						 0,         /*4월비과세국외근로소득원화*/       
						 0,         /*4월비과세생산직근로자야근수당*/   
						-1,         /*4월기타비과세내용*/               
						 0,         /*4월기타비과세금액*/               
						-1,         /*5월비과세지급년월*/               
						 0,         /*5월비과세국외근로소득외화*/       
						 0,         /*5월비과세외근로소득원화*/         
						 0,         /*5월비과세국생산직근로자야근수당*/ 
						-1,         /*5월기타비과세내용*/               
						 0,         /*5월기타비과세금액*/               
						-1,         /*6월비과세지급년월*/               
						 0,         /*6월비과세국외근로소득외화*/       
						 0,         /*6월비과세국외근로소득원화*/       
						 0,         /*6월비과세생산직근로자야근수당*/   
						-1,         /*6월기타비과세내용*/               
						 0,         /*6월기타비과세금액*/               
						-1,         /*7월비과세지급년월*/               
						 0,         /*7월비과세국외근로소득외화*/       
						 0,         /*7월비과세국외근로소득원화*/       
						 0,         /*7월비과세생산직근로자야근수당*/   
						-1,         /*7월기타비과세내용*/               
						 0,         /*7월기타비과세금액*/               
						-1,         /*8월비과세지급년월*/               
						 0,         /*8월비과세국외근로소득외화*/       
						 0,         /*8월비과세국외근로소득원화*/       
						 0,         /*8월비과세생산직근로자야근수당*/   
						-1,         /*8월기타비과세내용*/               
						 0,         /*8월기타비과세금액*/               
						-1,         /*9월비과세지급년월*/               
						 0,         /*9월비과세국외근로소득외화*/       
						 0,         /*9월비과세국외근로소득원화*/       
						 0,         /*9월비과세생산직근로자야근수당*/   
						-1,         /*9월기타비과세내용*/               
						 0,         /*9월기타비과세금액*/               
						-1,         /*10월비과세지급년월*/              
						 0,         /*10월비과세국외근로소득외화*/      
						 0,         /*10월비과세국외근로소득원화*/      
						 0,         /*10월비과세생산직근로자야근수당*/  
						-1,         /*10월기타비과세내용*/              
						 0,         /*10월기타비과세금액*/              
						-1,         /*11월비과세지급년월*/              
						 0,         /*11월비과세국외근로소득외화*/      
						 0,         /*11월비과세국외근로소득원화*/      
						 0,         /*11월비과세생산직근로자야근수당*/  
						-1,         /*11월기타비과세내용*/              
						 0,         /*11월기타비과세금액*/              
						-1,         /*12월비과세지급년월*/              
						 0,         /*12월비과세국외근로소득외화*/      
						 0,         /*12월비과세국외근로소득원화*/      
						 0,         /*12월비과세국생산직근로자야근수당*/
						-1,         /*12월기타비과세내용*/              
						 0,         /*12월기타비과세금액*/              
						 0,         /*년간국외근로소득외화계*/          
						 0,         /*년간국외근로소득원화계*/          
						 0,         /*년간생산직야간근로수당계*/        
						 0,         /*년간기타비과세계*/                
						 0,         /*1월감면세액*/                     
						 0,         /*1월소득세*/                       
						 0,         /*1월주민세*/                       
						 0,         /*1월농어촌특별세*/                 
						 0,         /*1월연금보험*/                     
						 0,         /*1월건강보험*/                     
						 0,         /*1월고용보험*/                     
						 0,         /*1월기부금*/                       
						 0,         /*2월감면세액*/                     
						 0,         /*2월소득세*/                       
						 0,         /*2월주민세*/                       
						 0,         /*2월농어촌특별세*/                 
						 0,         /*2월연금보험*/                     
						 0,         /*2월건강보험*/                     
						 0,         /*2월고용보험*/                     
						 0,         /*2월기부금*/                       
						 0,         /*3월감면세액*/                     
						 0,         /*3월소득세*/                       
						 0,         /*3월주민세*/                       
						 0,         /*3월농어촌특별세*/                 
						 0,         /*3월연금보험*/                     
						 0,         /*3월건강보험*/                     
						 0,         /*3월고용보험*/                     
						 0,         /*3월기부금*/                       
						 0,         /*4월감면세액*/                     
						 0,         /*4월소득세*/                       
						 0,         /*4월주민세*/                       
						 0,         /*4월농어촌특별세*/                 
						 0,         /*4월연금보험*/                     
						 0,         /*4월건강보험*/                     
						 0,         /*4월고용보험*/                     
						 0,         /*4월기부금*/                       
						 0,         /*5월감면세액*/                     
						 0,         /*5월소득세*/                       
						 0,         /*5월주민세*/                       
						 0,         /*5월농어촌특별세*/                 
						 0,         /*5월연금보험*/                     
						 0,         /*5월건강보험*/                     
						 0,         /*5월고용보험*/                     
						 0,         /*5월기부금*/                       
						 0,         /*6월감면세액*/                     
						 0,         /*6월소득세*/                       
						 0,         /*6월주민세*/                       
						 0,         /*6월농어촌특별세*/                 
						 0,         /*6월연금보험*/                     
						 0,         /*6월건강보험*/                     
						 0,         /*6월고용보험*/                     
						 0,         /*6월기부금*/                       
						 0,         /*7월감면세액*/                     
						 0,         /*7월소득세*/                       
						 0,         /*7월주민세*/                       
						 0,         /*7월농어촌특별세*/                 
						 0,         /*7월연금보험*/                     
						 0,         /*7월건강보험*/                     
						 0,         /*7월고용보험*/                     
						 0,         /*7월기부금*/                       
						 0,         /*8월감면세액*/                     
						 0,         /*8월소득세*/                       
						 0,         /*8월주민세*/                       
						 0,         /*8월농어촌특별세*/                 
						 0,         /*8월연금보험*/                     
						 0,         /*8월건강보험*/                     
						 0,         /*8월고용보험*/                     
						 0,         /*8월기부금*/                       
						 0,         /*9월감면세액*/                     
						 0,         /*9월소득세*/                       
						 0,         /*9월주민세*/                       
						 0,         /*9월농어촌특별세*/                 
						 0,         /*9월연금보험*/                     
						 0,         /*9월건강보험*/                     
						 0,         /*9월고용보험*/                     
						 0,         /*9월기부금*/                       
						 0,         /*10월감면세액*/                    
						 0,         /*10월소득세*/                      
						 0,         /*10월주민세*/                      
						 0,         /*10월농어촌특별세*/                
						 0,         /*10월연금보험*/                    
						 0,         /*10월건강보험*/                    
						 0,         /*10월고용보험*/                    
						 0,         /*10월기부금*/                      
						 0,         /*11월감면세액*/                    
						 0,         /*11월소득세*/                      
						 0,         /*11월주민세*/                      
						 0,         /*11월농어촌특별세*/                
						 0,         /*11월연금보험*/                    
						 0,         /*11월건강보험*/                    
						 0,         /*11월고용보험*/                    
						 0,         /*11월기부금*/                      
						 0,         /*12월감면세액*/                    
						 0,         /*12월소득세*/                      
						 0,         /*12월주민세*/                      
						 0,         /*12월농어촌특별세*/                
						 0,         /*12월연금보험*/                    
						 0,         /*12월건강보험*/                    
						 0,         /*12월고용보험*/                    
						 0,         /*12월기부금*/                      
						 0,         /*년간소득세계*/                    
						 0,         /*년간주민세계*/                    
						 0,         /*년간농특세계*/                    
						 0,         /*년간연금보험계*/                  
						 0,         /*년간건강보험계*/                  
						 0,         /*년간고용보험계*/                  
						 0,         /*년간기부금계*/                    
						-1,         /*진행상태*/
						-1,					/*작성일자*/
						 0,      	  /*종전근무 - 급여*/						
						 0,      	  /*종전근무 - 상여*/						
						 0,      	  /*종전근무 - 인정상여*/				
						 0,      	  /*종전근무 - 총급여계*/				
						 0,      	  /*종전근무 - 세액계*/					
						 0,      	  /*종전근무 - 국외근로비과세*/	
						 0,      	  /*종전근무 - 야간근로비과세*/	
						 0,      	  /*종전근무 - 기타비과세*/			
						 0,      	  /*종전근무 - 국민연금*/				
						 0,      	  /*종전근무 - 건강보험*/				
						 0,      	  /*종전근무 - 고용보험*/				
						 0,      	  /*종전근무 - 소득세*/					
						 0,      	  /*종전근무 - 주민세*/					
						 0,     	  /*종전근무 - 농특세*/			
						 0,0,0,0,0,0,
             0,0,0,0,0,0,
             0
				}; 

				for (int i=0; i<strArrCN.length; i++) { // set column column 
					switch ( intArrCN2[i] ) { 
						case -1 : dSet.addDataColumn(new GauceDataColumn(strArrCN[i], GauceDataColumn.TB_STRING, intArrCN[i])); break; 
						default : dSet.addDataColumn( new GauceDataColumn( strArrCN[i], GauceDataColumn.TB_DECIMAL, intArrCN[i], intArrCN2[i] ) ); break; 
					} 
				} 

				if (!GauceReq.isBuilderRequest()) {					
					StringBuffer sql = new StringBuffer();
						sql.append(" SELECT																							\n");
						sql.append(" A.YYYY,			/*귀속연도*/													\n");
						sql.append(" A.EMPNO,			/*사번*/															\n");
						sql.append(" A.EMPNMK,		/*성명*/															\n");
						sql.append(" A.RESINO,		/*주민등록번호*/											\n");
						sql.append(" A.FAMCNT,		/*공제대상가족수*/										\n");
						sql.append(" A.INCYY01,	/*1월지급년월*/													\n");
						sql.append(" A.INC01001,	/*1월급여액*/													\n");
						sql.append(" A.INC01002,	/*1월상여액*/													\n");
						sql.append(" A.INC01003,	/*1월인정상여*/												\n");
						sql.append(" A.INC01004,	/*1월총급여계*/												\n");
						sql.append(" A.INC01005,	/*1월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY02,	/*2월지급년월*/													\n");
						sql.append(" A.INC02001,	/*2월급여액*/													\n");
						sql.append(" A.INC02002,	/*2월상여액*/													\n");
						sql.append(" A.INC02003,	/*2월인정상여*/												\n");
						sql.append(" A.INC02004,	/*2월총급여계*/												\n");
						sql.append(" A.INC02005,	/*2월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY03,	/*3월지급년월*/													\n");
						sql.append(" A.INC03001,	/*3월급여액*/													\n");
						sql.append(" A.INC03002,	/*3월상여액*/													\n");
						sql.append(" A.INC03003,	/*3월인정상여*/												\n");
						sql.append(" A.INC03004,	/*3월총급여계*/												\n");
						sql.append(" A.INC03005,	/*3월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY04,	/*4월지급년월*/													\n");
						sql.append(" A.INC04001,	/*4월급여액*/													\n");
						sql.append(" A.INC04002,	/*4월상여액*/													\n");
						sql.append(" A.INC04003,	/*4월인정상여*/												\n");
						sql.append(" A.INC04004,	/*4월총급여계*/												\n");
						sql.append(" A.INC04005,	/*4월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY05,	/*5월지급년월*/													\n");
						sql.append(" A.INC05001,	/*5월급여액*/													\n");
						sql.append(" A.INC05002,	/*5월상여액*/													\n");
						sql.append(" A.INC05003,	/*5월인정상여*/												\n");
						sql.append(" A.INC05004,	/*5월총급여계*/												\n");
						sql.append(" A.INC05005,	/*5월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY06,	/*6월지급년월*/													\n");
						sql.append(" A.INC06001,	/*6월급여액*/													\n");
						sql.append(" A.INC06002,	/*6월상여액*/													\n");
						sql.append(" A.INC06003,	/*6월인정상여*/												\n");
						sql.append(" A.INC06004,	/*6월총급여계*/												\n");
						sql.append(" A.INC06005,	/*6월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY07,	/*7월지급년월*/													\n");
						sql.append(" A.INC07001,	/*7월급여액*/													\n");
						sql.append(" A.INC07002,	/*7월상여액*/													\n");
						sql.append(" A.INC07003,	/*7월인정상여*/												\n");
						sql.append(" A.INC07004,	/*7월총급여계*/												\n");
						sql.append(" A.INC07005,	/*7월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY08,	/*8월지급년월*/													\n");
						sql.append(" A.INC08001,	/*8월급여액*/													\n");
						sql.append(" A.INC08002,	/*8월상여액*/													\n");
						sql.append(" A.INC08003,	/*8월인정상여*/												\n");
						sql.append(" A.INC08004,	/*8월총급여계*/												\n");
						sql.append(" A.INC08005,	/*8월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY09,	/*9월지급년월*/													\n");
						sql.append(" A.INC09001,	/*9월급여액*/													\n");
						sql.append(" A.INC09002,	/*9월상여액*/													\n");
						sql.append(" A.INC09003,	/*9월인정상여*/												\n");
						sql.append(" A.INC09004,	/*9월총급여계*/												\n");
						sql.append(" A.INC09005,	/*9월간이세액표에 의한 소득세*/				\n");
						sql.append(" A.INCYY10,	/*10월지급년월*/												\n");
						sql.append(" A.INC10001,	/*10월급여액*/												\n");
						sql.append(" A.INC10002,	/*10월상여액*/												\n");
						sql.append(" A.INC10003,	/*10월인정상여*/											\n");
						sql.append(" A.INC10004,	/*10월총급여계*/											\n");
						sql.append(" A.INC10005,	/*10월간이세액표에 의한 소득세*/			\n");
						sql.append(" A.INCYY11,	/*11월지급년월*/												\n");
						sql.append(" A.INC11001,	/*11월급여액*/												\n");
						sql.append(" A.INC11002,	/*11월상여액*/												\n");
						sql.append(" A.INC11003,	/*11월인정상여*/											\n");
						sql.append(" A.INC11004,	/*11월총급여계*/											\n");
						sql.append(" A.INC11005,	/*11월간이세액표에 의한 소득세*/			\n");
						sql.append(" A.INCYY12,	/*12월지급년월*/												\n");
						sql.append(" A.INC12001,	/*12월급여액*/												\n");
						sql.append(" A.INC12002,	/*12월상여액*/												\n");
						sql.append(" A.INC12003,	/*12월인정상여*/											\n");
						sql.append(" A.INC12004,	/*12월총급여계*/											\n");
						sql.append(" A.INC12005,	/*12월간이세액표에 의한 소득세*/			\n");
						sql.append(" A.SINC001,	/*년간급여계*/													\n");
						sql.append(" A.SINC002,	/*년간상여계*/													\n");
						sql.append(" A.SINC003,	/*년간인정상여계*/											\n");
						sql.append(" A.SINC004,	/*년간총급여계*/												\n");
						sql.append(" A.SINC005,	/*년간간이세액표에의한소득세계*/				\n");
						sql.append(" A.FREYY01,	/*1월비과세지급년월*/										\n");
						sql.append(" A.FRE01001,	/*1월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE01002,	/*1월비과세국외근로소득원화*/					\n");
						sql.append(" A.FRE01003,	/*1월비과세생산직근로자야근수당*/			\n");
						sql.append(" RTRIM(A.FRE01004) FRE01004,	/*1월기타비과세내용*/	\n");
						sql.append(" A.FRE01005,	/*1월기타비과세금액*/									\n");
						sql.append(" A.FREYY02,	/*2월비과세지급년월*/										\n");
						sql.append(" A.FRE02001,	/*2월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE02002,	/*2월비과세국외근로소득원화*/					\n");
						sql.append(" A.FRE02003,	/*2월비과세생산직근로자야근수당*/			\n");
						sql.append(" RTRIM(A.FRE02004) FRE02004,	/*2월기타비과세내용*/	\n");
						sql.append(" A.FRE02005,	/*2월기타비과세금액*/									\n");
						sql.append(" A.FREYY03,	/*3월비과세지급년월*/										\n");
						sql.append(" A.FRE03001,	/*3월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE03002,	/*3월비과세국외근로소득원화*/					\n");
						sql.append(" A.FRE03003,	/*3월비과세생산직근로자야근수당*/			\n");
						sql.append(" RTRIM(A.FRE03004) FRE03004,	/*3월기타비과세내용*/	\n");
						sql.append(" A.FRE03005,	/*3월기타비과세금액*/									\n");
						sql.append(" A.FREYY04,	/*4월비과세지급년월*/										\n");
						sql.append(" A.FRE04001,	/*4월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE04002,	/*4월비과세국외근로소득원화*/					\n");
						sql.append(" A.FRE04003,	/*4월비과세생산직근로자야근수당*/			\n");
						sql.append(" RTRIM(A.FRE04004) FRE04004,	/*4월기타비과세내용*/	\n");
						sql.append(" A.FRE04005,	/*4월기타비과세금액*/									\n");
						sql.append(" A.FREYY05,	/*5월비과세지급년월*/										\n");
						sql.append(" A.FRE05001,	/*5월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE05002,	/*5월비과세외근로소득원화*/						\n");
						sql.append(" A.FRE05003,	/*5월비과세국생산직근로자야근수당*/		\n");
						sql.append(" RTRIM(A.FRE05004) FRE05004,	/*5월기타비과세내용*/	\n");
						sql.append(" A.FRE05005,	/*5월기타비과세금액*/									\n");
						sql.append(" A.FREYY06,	/*6월비과세지급년월*/										\n");
						sql.append(" A.FRE06001,	/*6월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE06002,	/*6월비과세국외근로소득원화*/					\n");
						sql.append(" A.FRE06003,	/*6월비과세생산직근로자야근수당*/			\n");
						sql.append(" RTRIM(A.FRE06004) FRE06004,	/*6월기타비과세내용*/	\n");
						sql.append(" A.FRE06005,	/*6월기타비과세금액*/									\n");
						sql.append(" A.FREYY07,	/*7월비과세지급년월*/										\n");
						sql.append(" A.FRE07001,	/*7월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE07002,	/*7월비과세국외근로소득원화*/					\n");
						sql.append(" A.FRE07003,	/*7월비과세생산직근로자야근수당*/			\n");
						sql.append(" RTRIM(A.FRE07004) FRE07004,	/*7월기타비과세내용*/	\n");
						sql.append(" A.FRE07005,	/*7월기타비과세금액*/									\n");
						sql.append(" A.FREYY08,	/*8월비과세지급년월*/										\n");
						sql.append(" A.FRE08001,	/*8월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE08002,	/*8월비과세국외근로소득원화*/					\n");
						sql.append(" A.FRE08003,	/*8월비과세생산직근로자야근수당*/			\n");
						sql.append(" RTRIM(A.FRE08004) FRE08004,	/*8월기타비과세내용*/	\n");
						sql.append(" A.FRE08005,	/*8월기타비과세금액*/									\n");
						sql.append(" A.FREYY09,	/*9월비과세지급년월*/										\n");
						sql.append(" A.FRE09001,	/*9월비과세국외근로소득외화*/					\n");
						sql.append(" A.FRE09002,	/*9월비과세국외근로소득원화*/					\n");
						sql.append(" A.FRE09003,	/*9월비과세생산직근로자야근수당*/			\n");
						sql.append(" RTRIM(A.FRE09004) FRE09004,	/*9월기타비과세내용*/	\n");
						sql.append(" A.FRE09005,	/*9월기타비과세금액*/									\n");
						sql.append(" A.FREYY10,	/*10월비과세지급년월*/									\n");
						sql.append(" A.FRE10001,	/*10월비과세국외근로소득외화*/				\n");
						sql.append(" A.FRE10002,	/*10월비과세국외근로소득원화*/				\n");
						sql.append(" A.FRE10003,	/*10월비과세생산직근로자야근수당*/		\n");
						sql.append(" RTRIM(A.FRE10004) FRE10004,	/*10월기타비과세내용*/\n");
						sql.append(" A.FRE10005,	/*10월기타비과세금액*/								\n");
						sql.append(" A.FREYY11,	/*11월비과세지급년월*/									\n");
						sql.append(" A.FRE11001,	/*11월비과세국외근로소득외화*/				\n");
						sql.append(" A.FRE11002,	/*11월비과세국외근로소득원화*/				\n");
						sql.append(" A.FRE11003,	/*11월비과세생산직근로자야근수당*/		\n");
						sql.append(" RTRIM(A.FRE11004) FRE11004,	/*11월기타비과세내용*/\n");
						sql.append(" A.FRE11005,	/*11월기타비과세금액*/								\n");
						sql.append(" A.FREYY12,	/*12월비과세지급년월*/									\n");
						sql.append(" A.FRE12001,	/*12월비과세국외근로소득외화*/				\n");
						sql.append(" A.FRE12002,	/*12월비과세국외근로소득원화*/				\n");
						sql.append(" A.FRE12003,	/*12월비과세국생산직근로자야근수당*/	\n");
						sql.append(" RTRIM(A.FRE12004) FRE12004,	/*12월기타비과세내용*/\n");
						sql.append(" A.FRE12005,	/*12월기타비과세금액*/								\n");
						sql.append(" A.SFRE001,		/*년간국외근로소득외화계*/						\n");
						sql.append(" A.SFRE002,		/*년간국외근로소득원화계*/						\n");
						sql.append(" A.SFRE003,		/*년간생산직야간근로수당계*/					\n");
						sql.append(" A.SFRE005,		/*년간기타비과세계*/									\n");
						sql.append(" A.COL01001,/*1월감면세액*/													\n");
						sql.append(" A.COL01002,	/*1월소득세*/													\n");
						sql.append(" A.COL01003,	/*1월주민세*/													\n");
						sql.append(" A.COL01004,	/*1월농어촌특별세*/										\n");
						sql.append(" A.COL01005,	/*1월연금보험*/												\n");
						sql.append(" A.COL01006,	/*1월건강보험*/												\n");
						sql.append(" A.COL01007,	/*1월고용보험*/												\n");
						sql.append(" A.COL01008,	/*1월기부금*/													\n");
						sql.append(" A.COL02001,/*2월감면세액*/													\n");
						sql.append(" A.COL02002,	/*2월소득세*/													\n");
						sql.append(" A.COL02003,	/*2월주민세*/													\n");
						sql.append(" A.COL02004,	/*2월농어촌특별세*/										\n");
						sql.append(" A.COL02005,	/*2월연금보험*/												\n");
						sql.append(" A.COL02006,	/*2월건강보험*/												\n");
						sql.append(" A.COL02007,	/*2월고용보험*/												\n");
						sql.append(" A.COL02008,	/*2월기부금*/													\n");
						sql.append(" A.COL03001,/*3월감면세액*/													\n");
						sql.append(" A.COL03002,	/*3월소득세*/													\n");
						sql.append(" A.COL03003,	/*3월주민세*/													\n");
						sql.append(" A.COL03004,	/*3월농어촌특별세*/										\n");
						sql.append(" A.COL03005,	/*3월연금보험*/												\n");
						sql.append(" A.COL03006,	/*3월건강보험*/												\n");
						sql.append(" A.COL03007,	/*3월고용보험*/												\n");
						sql.append(" A.COL03008,	/*3월기부금*/													\n");
						sql.append(" A.COL04001,/*4월감면세액*/													\n");
						sql.append(" A.COL04002,	/*4월소득세*/													\n");
						sql.append(" A.COL04003,	/*4월주민세*/													\n");
						sql.append(" A.COL04004,	/*4월농어촌특별세*/										\n");
						sql.append(" A.COL04005,	/*4월연금보험*/												\n");
						sql.append(" A.COL04006,	/*4월건강보험*/												\n");
						sql.append(" A.COL04007,	/*4월고용보험*/												\n");
						sql.append(" A.COL04008,	/*4월기부금*/													\n");
						sql.append(" A.COL05001,/*5월감면세액*/													\n");
						sql.append(" A.COL05002,	/*5월소득세*/													\n");
						sql.append(" A.COL05003,	/*5월주민세*/													\n");
						sql.append(" A.COL05004,	/*5월농어촌특별세*/										\n");
						sql.append(" A.COL05005,	/*5월연금보험*/												\n");
						sql.append(" A.COL05006,	/*5월건강보험*/												\n");
						sql.append(" A.COL05007,	/*5월고용보험*/												\n");
						sql.append(" A.COL05008,	/*5월기부금*/													\n");
						sql.append(" A.COL06001,/*6월감면세액*/													\n");
						sql.append(" A.COL06002,	/*6월소득세*/													\n");
						sql.append(" A.COL06003,	/*6월주민세*/													\n");
						sql.append(" A.COL06004,	/*6월농어촌특별세*/										\n");
						sql.append(" A.COL06005,	/*6월연금보험*/												\n");
						sql.append(" A.COL06006,	/*6월건강보험*/												\n");
						sql.append(" A.COL06007,	/*6월고용보험*/												\n");
						sql.append(" A.COL06008,	/*6월기부금*/													\n");
						sql.append(" A.COL07001,/*7월감면세액*/													\n");
						sql.append(" A.COL07002,	/*7월소득세*/													\n");
						sql.append(" A.COL07003,	/*7월주민세*/													\n");
						sql.append(" A.COL07004,	/*7월농어촌특별세*/										\n");
						sql.append(" A.COL07005,	/*7월연금보험*/												\n");
						sql.append(" A.COL07006,	/*7월건강보험*/												\n");
						sql.append(" A.COL07007,	/*7월고용보험*/												\n");
						sql.append(" A.COL07008,	/*7월기부금*/													\n");
						sql.append(" A.COL08001,/*8월감면세액*/													\n");
						sql.append(" A.COL08002,	/*8월소득세*/													\n");
						sql.append(" A.COL08003,	/*8월주민세*/													\n");
						sql.append(" A.COL08004,	/*8월농어촌특별세*/										\n");
						sql.append(" A.COL08005,	/*8월연금보험*/												\n");
						sql.append(" A.COL08006,	/*8월건강보험*/												\n");
						sql.append(" A.COL08007,	/*8월고용보험*/												\n");
						sql.append(" A.COL08008,	/*8월기부금*/													\n");
						sql.append(" A.COL09001,/*9월감면세액*/													\n");
						sql.append(" A.COL09002,	/*9월소득세*/													\n");
						sql.append(" A.COL09003,	/*9월주민세*/													\n");
						sql.append(" A.COL09004,	/*9월농어촌특별세*/										\n");
						sql.append(" A.COL09005,	/*9월연금보험*/												\n");
						sql.append(" A.COL09006,	/*9월건강보험*/												\n");
						sql.append(" A.COL09007,	/*9월고용보험*/												\n");
						sql.append(" A.COL09008,	/*9월기부금*/													\n");
						sql.append(" A.COL10001,/*10월감면세액*/												\n");
						sql.append(" A.COL10002,	/*10월소득세*/												\n");
						sql.append(" A.COL10003,	/*10월주민세*/												\n");
						sql.append(" A.COL10004,	/*10월농어촌특별세*/									\n");
						sql.append(" A.COL10005,	/*10월연금보험*/											\n");
						sql.append(" A.COL10006,	/*10월건강보험*/											\n");
						sql.append(" A.COL10007,	/*10월고용보험*/											\n");
						sql.append(" A.COL10008,	/*10월기부금*/												\n");
						sql.append(" A.COL11001,/*11월감면세액*/												\n");
						sql.append(" A.COL11002,	/*11월소득세*/												\n");
						sql.append(" A.COL11003,	/*11월주민세*/												\n");
						sql.append(" A.COL11004,	/*11월농어촌특별세*/									\n");
						sql.append(" A.COL11005,	/*11월연금보험*/											\n");
						sql.append(" A.COL11006,	/*11월건강보험*/											\n");
						sql.append(" A.COL11007,	/*11월고용보험*/											\n");
						sql.append(" A.COL11008,	/*11월기부금*/												\n");
						sql.append(" A.COL12001,/*12월감면세액*/												\n");
						sql.append(" A.COL12002,	/*12월소득세*/												\n");
						sql.append(" A.COL12003,	/*12월주민세*/												\n");
						sql.append(" A.COL12004,	/*12월농어촌특별세*/									\n");
						sql.append(" A.COL12005,	/*12월연금보험*/											\n");
						sql.append(" A.COL12006,	/*12월건강보험*/											\n");
						sql.append(" A.COL12007,	/*12월고용보험*/											\n");
						sql.append(" A.COL12008,	/*12월기부금*/												\n");
						sql.append(" A.SCOL002,		/*년간소득세계*/											\n");
						sql.append(" A.SCOL003,		/*년간주민세계*/											\n");
						sql.append(" A.SCOL004,		/*년간농특세계*/											\n");
						sql.append(" A.SCOL005,		/*년간연금보험계*/										\n");
						sql.append(" A.SCOL006,		/*년간건강보험계*/										\n");
						sql.append(" A.SCOL007,		/*년간고용보험계*/										\n");
						sql.append(" A.SCOL008,		/*년간기부금계*/											\n");
						sql.append(" A.PROSTS,		/*진행상태*/													\n");
						sql.append(" '"+str[2]+"' AS CURDT,	/*귀속년도*/								\n");
						sql.append(" COALESCE(B.BP11000,0) BP11000, /*종전근무 - 급여*/						\n");
						sql.append(" COALESCE(B.BP12000,0) BP12000, /*종전근무 - 상여*/						\n");
						sql.append(" COALESCE(B.BP13000,0) BP13000, /*종전근무 - 인정상여*/				\n");
						sql.append(" COALESCE(B.BP10SUM,0) BP10SUM, /*종전근무 - 총급여계*/				\n");
						sql.append(" COALESCE(B.BP40SUM,0) BP40SUM, /*종전근무 - 세액계*/					\n");
						sql.append(" COALESCE(B.BP21000,0) BP21000, /*종전근무 - 국외근로비과세*/	\n");
						sql.append(" COALESCE(B.BP22000,0) BP22000, /*종전근무 - 야간근로비과세*/	\n");
						sql.append(" COALESCE(B.BP23000,0) BP23000, /*종전근무 - 기타비과세*/			\n");
						sql.append(" COALESCE(B.BP31000,0) BP31000, /*종전근무 - 국민연금*/				\n");
						sql.append(" COALESCE(B.BP32000,0) BP32000, /*종전근무 - 건강보험*/				\n");
						sql.append(" COALESCE(B.BP33000,0) BP33000, /*종전근무 - 고용보험*/				\n");
						sql.append(" COALESCE(B.BP41000,0) BP41000, /*종전근무 - 소득세*/					\n");
						sql.append(" COALESCE(B.BP42000,0) BP42000, /*종전근무 - 주민세*/					\n");
						sql.append(" COALESCE(B.BP43000,0) BP43000, /*종전근무 - 농특세*/					\n");

            //JYS. 2010.01.05 비과세합계추가 
            sql.append(" COALESCE(A.FRE01001,0) + COALESCE(A.FRE01002,0) + COALESCE(A.FRE01003,0)+ COALESCE(A.FRE01005,0)  AS FRE01_SUM, \n");
						sql.append(" COALESCE(A.FRE02001,0) + COALESCE(A.FRE02002,0) + COALESCE(A.FRE02003,0)+ COALESCE(A.FRE02005,0)  AS FRE02_SUM, \n");
						sql.append(" COALESCE(A.FRE03001,0) + COALESCE(A.FRE03002,0) + COALESCE(A.FRE03003,0)+ COALESCE(A.FRE03005,0)  AS FRE03_SUM, \n");
            sql.append(" COALESCE(A.FRE04001,0) + COALESCE(A.FRE04002,0) + COALESCE(A.FRE04003,0)+ COALESCE(A.FRE04005,0)  AS FRE04_SUM, \n");
						sql.append(" COALESCE(A.FRE05001,0) + COALESCE(A.FRE05002,0) + COALESCE(A.FRE05003,0)+ COALESCE(A.FRE05005,0)  AS FRE05_SUM, \n");
						sql.append(" COALESCE(A.FRE06001,0) + COALESCE(A.FRE06002,0) + COALESCE(A.FRE06003,0)+ COALESCE(A.FRE06005,0)  AS FRE06_SUM, \n");
						sql.append(" COALESCE(A.FRE07001,0) + COALESCE(A.FRE07002,0) + COALESCE(A.FRE07003,0)+ COALESCE(A.FRE07005,0)  AS FRE07_SUM, \n");
						sql.append(" COALESCE(A.FRE08001,0) + COALESCE(A.FRE08002,0) + COALESCE(A.FRE08003,0)+ COALESCE(A.FRE08005,0)  AS FRE08_SUM, \n");
						sql.append(" COALESCE(A.FRE09001,0) + COALESCE(A.FRE09002,0) + COALESCE(A.FRE09003,0)+ COALESCE(A.FRE09005,0)  AS FRE09_SUM, \n");
						sql.append(" COALESCE(A.FRE10001,0) + COALESCE(A.FRE10002,0) + COALESCE(A.FRE10003,0)+ COALESCE(A.FRE10005,0)  AS FRE10_SUM, \n");
            sql.append(" COALESCE(A.FRE11001,0) + COALESCE(A.FRE11002,0) + COALESCE(A.FRE11003,0)+ COALESCE(A.FRE11005,0)  AS FRE11_SUM, \n");
						sql.append(" COALESCE(A.FRE12001,0) + COALESCE(A.FRE12002,0) + COALESCE(A.FRE12003,0)+ COALESCE(A.FRE12005,0)  AS FRE12_SUM, \n");
						sql.append(" COALESCE(A.SFRE001,0)+COALESCE(A.SFRE002,0)+COALESCE(A.SFRE003,0)+COALESCE(A.SFRE005,0) AS SFRE_SUM             \n");
						
						sql.append(" FROM PAYROLL.YCPERCOL A				/*소득자별근로소득원천징수*/	\n");	
						sql.append(" LEFT JOIN PAYROLL.YCBEFOFF B ON A.EMPNO = B.EMPNO						\n");
						sql.append(" AND COALESCE(B.SEQ,0) = (SELECT MAX(SEQ) FROM PAYROLL.YCBEFOFF WHERE EMPNO = A.EMPNO) \n");
						sql.append(" AND B.YYYY='"+str[1]+"' \n");
						sql.append(" LEFT JOIN PAYROLL.HIPERSON C ON A.EMPNO = C.EMPNO						\n");
						sql.append(" LEFT JOIN PAYROLL.HCDEPT   D ON C.DEPTCD = D.DEPTCD					\n");
						sql.append(" WHERE RTRIM(A.EMPNO) <> ''																		\n");
	
						if (!str[0].equals(""))	sql.append(" AND RTRIM(A.EMPNMK) LIKE '"+str[0]+"%'	\n"); 
						if (!str[1].equals(""))	sql.append(" AND A.YYYY = '"+str[1]+"'							\n");
						if (!str[3].equals(""))	sql.append(" AND D.DEPTCD = '"+str[3]+"'						\n");

						sql.append("\n").append( " ORDER BY A.EMPNMK \n");

/*********************************************************************************************/

					stmt = conn.getGauceStatement(sql.toString());
	 		    stmt.executeQuery(dSet);
				}
			} catch(Exception e) {
		  	logger.err.println(this,e);
		  } finally {
				if (stmt != null) try { stmt.close(); } catch (Exception e) {}
				if (conn != null) try {conn.close(true);} catch (Exception e) {}
			}

		  dSet.flush();
		  GauceRes.commit();
		  GauceRes.close();

		} catch (Exception e) {
			logger.err.println(this,e);
			logger.dbg.println(this,e.toString());
		} finally {
			loader.restoreService(service);
  	}
	}
}