<%
        String[] HotelInfo = new String[7];
        HotelInfo[0] = "";
        HotelInfo[1] = "만물상 입구에 자리잡은 금강산호텔에서는 천혜의 자연경관과 함께 북측봉사원들의 친절한 서비스를 경험할 수 있습니다.";
        HotelInfo[2] = "금강산 호텔을 마주하며 푸른 숲속에 위치한 자연의 순수함과 편안함을 담은 쾌적한 호텔입니다.";
        HotelInfo[3] = "금강산절경과 고성항의 푸른바다를 한눈에 조망할 수 있고 다양한 객실을 구비하고 있는 금강산 명품 호텔입니다.";
        HotelInfo[4] = "";
        HotelInfo[5] = "외금강 산자락을 병풍처럼 두루고 있는 외금강호텔은 북측 최고 명소인 김정숙휴양소를 리모델링한 고품격 호텔입니다.";
        HotelInfo[6] = "최고급 해상호텔인 호텔해금강은 금강산관광의 품격과 여유를 상징하는 대표적인 호텔입니다. ";
        
%>