package Payroll;

import com.gauce.*;
import com.gauce.io.*;
import com.gauce.common.*;
import com.gauce.log.*;
import com.gauce.db.*;
import javax.servlet.*;
import javax.servlet.http.*;
import java.sql.*;

// class 이름은 화일명과 항상 동일해야 함.
public class p030006_s2 extends HttpServlet {

	// 웹페이지의 폼의 전송방식이 Post 타입일 경우
	public void doGet(HttpServletRequest req, HttpServletResponse res) {
		res.setContentType("text/html;charset=ksc5601");
		ServiceLoader loader = new ServiceLoader(req, res);
		GauceService service = null;
		GauceContext context = null;
		Logger logger = null;
		GauceDBConnection conn = null;
		GauceStatement stmt =null;
		GauceDataSet dSet = null;

		try {
			service = loader.newService();
			context = service.getContext();
			logger = context.getLogger();

			GauceRequest GauceReq = service.getGauceRequest();
      GauceResponse GauceRes = service.getGauceResponse();

			try {
				conn = service.getDBConnection();
				dSet = new GauceDataSet();

/**********************************************************************************************
	실제 업무에서 적용하실 부분
**********************************************************************************************/
				// 웹페이지에서 조건값을 넘겨받음
				String [] str = new String [10];
				str[0]	= req.getParameter("v_str1");		//사번
				str[1]  = req.getParameter("v_str2");		//귀속년도
				str[2]  = req.getParameter("v_str3");		//작성일자

				for (int s=0;s<=2;s++) {
					if (str[s]==null) str[s] = "";
				}

				GauceRes.enableFirstRow(dSet);
				String[] strArrCN = new String[]{
						
						"YYYY",			/*귀속연도*/
						"EMPNO",    /*사번*/
						"EMPNMK",		/*성명*/
						"RESINO",		/*주민등록번호*/
						"FAMCNT",		/*공제대상가족수*/
						"INCYY01",	/*1월지급년월*/
						"INC01001",	/*1월급여액*/
						"INC01002",	/*1월상여액*/
						"INC01003",	/*1월인정상여*/
						"INC01004",	/*1월총급여계*/
						"INC01005",	/*1월간이세액표에 의한 소득세*/
						"INCYY02",	/*2월지급년월*/
						"INC02001",	/*2월급여액*/
						"INC02002",	/*2월상여액*/
						"INC02003",	/*2월인정상여*/
						"INC02004",	/*2월총급여계*/
						"INC02005",	/*2월간이세액표에 의한 소득세*/
						"INCYY03",	/*3월지급년월*/
						"INC03001",	/*3월급여액*/
						"INC03002",	/*3월상여액*/
						"INC03003",	/*3월인정상여*/
						"INC03004",	/*3월총급여계*/
						"INC03005",	/*3월간이세액표에 의한 소득세*/
						"INCYY04",	/*4월지급년월*/
						"INC04001",	/*4월급여액*/
						"INC04002",	/*4월상여액*/
						"INC04003",	/*4월인정상여*/
						"INC04004",	/*4월총급여계*/
						"INC04005",	/*4월간이세액표에 의한 소득세*/
						"INCYY05",	/*5월지급년월*/
						"INC05001",	/*5월급여액*/
						"INC05002",	/*5월상여액*/
						"INC05003",	/*5월인정상여*/
						"INC05004",	/*5월총급여계*/
						"INC05005",	/*5월간이세액표에 의한 소득세*/
						"INCYY06",	/*6월지급년월*/
						"INC06001",	/*6월급여액*/
						"INC06002",	/*6월상여액*/
						"INC06003",	/*6월인정상여*/
						"INC06004",	/*6월총급여계*/
						"INC06005",	/*6월간이세액표에 의한 소득세*/
						"INCYY07",	/*7월지급년월*/
						"INC07001",	/*7월급여액*/
						"INC07002",	/*7월상여액*/
						"INC07003",	/*7월인정상여*/
						"INC07004",	/*7월총급여계*/
						"INC07005",	/*7월간이세액표에 의한 소득세*/
						"INCYY08",	/*8월지급년월*/
						"INC08001",	/*8월급여액*/
						"INC08002",	/*8월상여액*/
						"INC08003",	/*8월인정상여*/
						"INC08004",	/*8월총급여계*/
						"INC08005",	/*8월간이세액표에 의한 소득세*/
						"INCYY09",	/*9월지급년월*/
						"INC09001",	/*9월급여액*/
						"INC09002",	/*9월상여액*/
						"INC09003",	/*9월인정상여*/
						"INC09004",	/*9월총급여계*/
						"INC09005",	/*9월간이세액표에 의한 소득세*/
						"INCYY10",	/*10월지급년월*/
						"INC10001",	/*10월급여액*/
						"INC10002",	/*10월상여액*/
						"INC10003",	/*10월인정상여*/
						"INC10004",	/*10월총급여계*/
						"INC10005",	/*10월간이세액표에 의한 소득세*/
						"INCYY11",	/*11월지급년월*/
						"INC11001",	/*11월급여액*/
						"INC11002",	/*11월상여액*/
						"INC11003",	/*11월인정상여*/
						"INC11004",	/*11월총급여계*/
						"INC11005",	/*11월간이세액표에 의한 소득세*/
						"INCYY12",	/*12월지급년월*/
						"INC12001",	/*12월급여액*/
						"INC12002",	/*12월상여액*/
						"INC12003",	/*12월인정상여*/
						"INC12004",	/*12월총급여계*/
						"INC12005",	/*12월간이세액표에 의한 소득세*/
						"SINC001",	/*년간급여계*/
						"SINC002",	/*년간상여계*/
						"SINC003",	/*년간인정상여계*/
						"SINC004",	/*년간총급여계*/
						"SINC005",	/*년간간이세액표에의한소득세계*/
						"FREYY01",	/*1월비과세지급년월*/
						"FRE01001",	/*1월비과세국외근로소득외화*/
						"FRE01002",	/*1월비과세국외근로소득원화*/
						"FRE01003",	/*1월비과세생산직근로자야근수당*/
						"FRE01004",	/*1월기타비과세내용*/
						"FRE01005",	/*1월기타비과세금액*/
						"FREYY02",	/*2월비과세지급년월*/
						"FRE02001",	/*2월비과세국외근로소득외화*/
						"FRE02002",	/*2월비과세국외근로소득원화*/
						"FRE02003",	/*2월비과세생산직근로자야근수당*/
						"FRE02004",	/*2월기타비과세내용*/
						"FRE02005",	/*2월기타비과세금액*/
						"FREYY03",	/*3월비과세지급년월*/
						"FRE03001",	/*3월비과세국외근로소득외화*/
						"FRE03002",	/*3월비과세국외근로소득원화*/
						"FRE03003",	/*3월비과세생산직근로자야근수당*/
						"FRE03004",	/*3월기타비과세내용*/
						"FRE03005",	/*3월기타비과세금액*/
						"FREYY04",	/*4월비과세지급년월*/
						"FRE04001",	/*4월비과세국외근로소득외화*/
						"FRE04002",	/*4월비과세국외근로소득원화*/
						"FRE04003",	/*4월비과세생산직근로자야근수당*/
						"FRE04004",	/*4월기타비과세내용*/
						"FRE04005",	/*4월기타비과세금액*/
						"FREYY05",	/*5월비과세지급년월*/
						"FRE05001",	/*5월비과세국외근로소득외화*/
						"FRE05002",	/*5월비과세외근로소득원화*/
						"FRE05003",	/*5월비과세국생산직근로자야근수당*/
						"FRE05004",	/*5월기타비과세내용*/
						"FRE05005",	/*5월기타비과세금액*/
						"FREYY06",	/*6월비과세지급년월*/
						"FRE06001",	/*6월비과세국외근로소득외화*/
						"FRE06002",	/*6월비과세국외근로소득원화*/
						"FRE06003",	/*6월비과세생산직근로자야근수당*/
						"FRE06004",	/*6월기타비과세내용*/
						"FRE06005",	/*6월기타비과세금액*/
						"FREYY07",	/*7월비과세지급년월*/
						"FRE07001",	/*7월비과세국외근로소득외화*/
						"FRE07002",	/*7월비과세국외근로소득원화*/
						"FRE07003",	/*7월비과세생산직근로자야근수당*/
						"FRE07004",	/*7월기타비과세내용*/
						"FRE07005",	/*7월기타비과세금액*/
						"FREYY08",	/*8월비과세지급년월*/
						"FRE08001",	/*8월비과세국외근로소득외화*/
						"FRE08002",	/*8월비과세국외근로소득원화*/
						"FRE08003",	/*8월비과세생산직근로자야근수당*/
						"FRE08004",	/*8월기타비과세내용*/
						"FRE08005",	/*8월기타비과세금액*/
						"FREYY09",	/*9월비과세지급년월*/
						"FRE09001",	/*9월비과세국외근로소득외화*/
						"FRE09002",	/*9월비과세국외근로소득원화*/
						"FRE09003",	/*9월비과세생산직근로자야근수당*/
						"FRE09004",	/*9월기타비과세내용*/
						"FRE09005",	/*9월기타비과세금액*/
						"FREYY10",	/*10월비과세지급년월*/
						"FRE10001",	/*10월비과세국외근로소득외화*/
						"FRE10002",	/*10월비과세국외근로소득원화*/
						"FRE10003",	/*10월비과세생산직근로자야근수당*/
						"FRE10004",	/*10월기타비과세내용*/
						"FRE10005",	/*10월기타비과세금액*/
						"FREYY11",	/*11월비과세지급년월*/
						"FRE01101",	/*11월비과세국외근로소득외화*/
						"FRE01102",	/*11월비과세국외근로소득원화*/
						"FRE01103",	/*11월비과세생산직근로자야근수당*/
						"FRE01104",	/*11월기타비과세내용*/
						"FRE01105",	/*11월기타비과세금액*/
						"FREYY12",	/*12월비과세지급년월*/
						"FRE12001",	/*12월비과세국외근로소득외화*/
						"FRE12002",	/*12월비과세국외근로소득원화*/
						"FRE12003",	/*12월비과세국생산직근로자야근수당*/
						"FRE12004",	/*12월기타비과세내용*/
						"FRE12005",	/*12월기타비과세금액*/
						"SFRE001",	/*년간국외근로소득외화계*/
						"SFRE002",	/*년간국외근로소득원화계*/
						"SFRE003",	/*년간생산직야간근로수당계*/
						"SFRE005",	/*년간기타비과세계*/
						"COL01001",	/*1월감면세액*/
						"COL01002",	/*1월소득세*/
						"COL01003",	/*1월주민세*/
						"COL01004",	/*1월농어촌특별세*/
						"COL01005",	/*1월연금보험*/
						"COL01006",	/*1월건강보험*/
						"COL01007",	/*1월고용보험*/
						"COL01008",	/*1월기부금*/
						"COL02001",	/*2월감면세액*/
						"COL02002",	/*2월소득세*/
						"COL02003",	/*2월주민세*/
						"COL02004",	/*2월농어촌특별세*/
						"COL02005",	/*2월연금보험*/
						"COL02006",	/*2월건강보험*/
						"COL02007",	/*2월고용보험*/
						"COL02008",	/*2월기부금*/
						"COL03001",	/*3월감면세액*/
						"COL03002",	/*3월소득세*/
						"COL03003",	/*3월주민세*/
						"COL03004",	/*3월농어촌특별세*/
						"COL03005",	/*3월연금보험*/
						"COL03006",	/*3월건강보험*/
						"COL03007",	/*3월고용보험*/
						"COL03008",	/*3월기부금*/
						"COL04001",	/*4월감면세액*/
						"COL04002",	/*4월소득세*/
						"COL04003",	/*4월주민세*/
						"COL04004",	/*4월농어촌특별세*/
						"COL04005",	/*4월연금보험*/
						"COL04006",	/*4월건강보험*/
						"COL04007",	/*4월고용보험*/
						"COL04008",	/*4월기부금*/
						"COL05001",	/*5월감면세액*/
						"COL05002",	/*5월소득세*/
						"COL05003",	/*5월주민세*/
						"COL05004",	/*5월농어촌특별세*/
						"COL05005",	/*5월연금보험*/
						"COL05006",	/*5월건강보험*/
						"COL05007",	/*5월고용보험*/
						"COL05008",	/*5월기부금*/
						"COL06001",	/*6월감면세액*/
						"COL06002",	/*6월소득세*/
						"COL06003",	/*6월주민세*/
						"COL06004",	/*6월농어촌특별세*/
						"COL06005",	/*6월연금보험*/
						"COL06006",	/*6월건강보험*/
						"COL06007",	/*6월고용보험*/
						"COL06008",	/*6월기부금*/
						"COL07001",	/*7월감면세액*/
						"COL07002",	/*7월소득세*/
						"COL07003",	/*7월주민세*/
						"COL07004",	/*7월농어촌특별세*/
						"COL07005",	/*7월연금보험*/
						"COL07006",	/*7월건강보험*/
						"COL07007",	/*7월고용보험*/
						"COL07008",	/*7월기부금*/
						"COL08001",	/*8월감면세액*/
						"COL08002",	/*8월소득세*/
						"COL08003",	/*8월주민세*/
						"COL08004",	/*8월농어촌특별세*/
						"COL08005",	/*8월연금보험*/
						"COL08006",	/*8월건강보험*/
						"COL08007",	/*8월고용보험*/
						"COL08008",	/*8월기부금*/
						"COL09001",	/*9월감면세액*/
						"COL09002",	/*9월소득세*/
						"COL09003",	/*9월주민세*/
						"COL09004",	/*9월농어촌특별세*/
						"COL09005",	/*9월연금보험*/
						"COL09006",	/*9월건강보험*/
						"COL09007",	/*9월고용보험*/
						"COL09008",	/*9월기부금*/
						"COL10001",	/*10월감면세액*/
						"COL10002",	/*10월소득세*/
						"COL10003",	/*10월주민세*/
						"COL10004",	/*10월농어촌특별세*/
						"COL10005",	/*10월연금보험*/
						"COL10006",	/*10월건강보험*/
						"COL10007",	/*10월고용보험*/
						"COL10008",	/*10월기부금*/
						"COL11001",	/*11월감면세액*/
						"COL11002",	/*11월소득세*/
						"COL11003",	/*11월주민세*/
						"COL11004",	/*11월농어촌특별세*/
						"COL11005",	/*11월연금보험*/
						"COL11006",	/*11월건강보험*/
						"COL11007",	/*11월고용보험*/
						"COL11008",	/*11월기부금*/
						"COL12001",	/*12월감면세액*/
						"COL12002",	/*12월소득세*/
						"COL12003",	/*12월주민세*/
						"COL12004",	/*12월농어촌특별세*/
						"COL12005",	/*12월연금보험*/
						"COL12006",	/*12월건강보험*/
						"COL12007",	/*12월고용보험*/
						"COL12008",	/*12월기부금*/
						"SCOL002",	/*년간소득세계*/
						"SCOL003",	/*년간주민세계*/
						"SCOL004",	/*년간농특세계*/
						"SCOL005",	/*년간연금보험계*/
						"SCOL006",	/*년간건강보험계*/
						"SCOL007",	/*년간고용보험계*/
						"SCOL008",	/*년간기부금계*/
						"PROSTS",	  /*진행상태*/
						"CURDT"			/*작성일자*/
				};

				int[] intArrCN = new int[]{  

						4,  /*귀속연도 4자리*/                         
						7,  /*사번*/                             
						20,	/*성명*/                             
						13, /*주민등록번호*/                     
						2, 	/*공제대상가족수*/                   
						6, 	/*1월지급년월*/                      
						9, 	/*1월급여액*/                        
						9, 	/*1월상여액*/                        
						9, 	/*1월인정상여*/                      
						9,	/*1월총급여계*/                      
						9,	/*1월간이세액표에 의한 소득세*/      
						6, 	/*2월지급년월*/                      
						9, 	/*2월급여액*/                        
						9, 	/*2월상여액*/                        
						9, 	/*2월인정상여*/                      
						9,	/*2월총급여계*/                      
						9,	/*2월간이세액표에 의한 소득세*/      
						6, 	/*3월지급년월*/                      
						9, 	/*3월급여액*/                        
						9, 	/*3월상여액*/                        
						9, 	/*3월인정상여*/                      
						9,	/*3월총급여계*/                      
						9,	/*3월간이세액표에 의한 소득세*/      
						6, 	/*4월지급년월*/                      
						9, 	/*4월급여액*/                        
						9, 	/*4월상여액*/                        
						9, 	/*4월인정상여*/                      
						9,	/*4월총급여계*/                      
						9,	/*4월간이세액표에 의한 소득세*/      
						6, 	/*5월지급년월*/                      
						9, 	/*5월급여액*/                        
						9, 	/*5월상여액*/                        
						9, 	/*5월인정상여*/                      
						9,	/*5월총급여계*/                      
						9,	/*5월간이세액표에 의한 소득세*/      
						6, 	/*6월지급년월*/                      
						9, 	/*6월급여액*/                        
						9, 	/*6월상여액*/                        
						9, 	/*6월인정상여*/                      
						9,	/*6월총급여계*/                      
						9,	/*6월간이세액표에 의한 소득세*/      
						6, 	/*7월지급년월*/                      
						9, 	/*7월급여액*/                        
						9, 	/*7월상여액*/                        
						9, 	/*7월인정상여*/                      
						9,	/*7월총급여계*/                      
						9,	/*7월간이세액표에 의한 소득세*/      
						6, 	/*8월지급년월*/                      
						9, 	/*8월급여액*/                        
						9, 	/*8월상여액*/                        
						9, 	/*8월인정상여*/                      
						9,	/*8월총급여계*/                      
						9,	/*8월간이세액표에 의한 소득세*/      
						6, 	/*9월지급년월*/                      
						9, 	/*9월급여액*/                        
						9, 	/*9월상여액*/                        
						9, 	/*9월인정상여*/                      
						9,	/*9월총급여계*/                      
						9,	/*9월간이세액표에 의한 소득세*/      
						6, 	/*10월지급년월*/                     
						9, 	/*10월급여액*/                       
						9, 	/*10월상여액*/                       
						9, 	/*10월인정상여*/                     
						9,	/*10월총급여계*/                     
						9,	/*10월간이세액표에 의한 소득세*/     
						6, 	/*11월지급년월*/                     
						9, 	/*11월급여액*/                       
						9, 	/*11월상여액*/                       
						9, 	/*11월인정상여*/                     
						9,	/*11월총급여계*/                     
						9,	/*11월간이세액표에 의한 소득세*/     
						6, 	/*12월지급년월*/                     
						9, 	/*12월급여액*/                       
						9, 	/*12월상여액*/                       
						9, 	/*12월인정상여*/                     
						9,	/*12월총급여계*/                     
						9,	/*12월간이세액표에 의한 소득세*/     
						11, /*년간급여계*/                       
						11, /*년간상여계*/                       
						11, /*년간인정상여계*/                   
						11, /*년간총급여계*/                     
						11, /*년간간이세액표에의한소득세계*/     
						6, 	/*1월비과세지급년월*/                
						9, 	/*1월비과세국외근로소득외화*/        
						9, 	/*1월비과세국외근로소득원화*/        
						9, 	/*1월비과세생산직근로자야근수당*/    
						20,	/*1월기타비과세내용*/                
						9,	/*1월기타비과세금액*/                
						6, 	/*2월비과세지급년월*/                
						9, 	/*2월비과세국외근로소득외화*/        
						9, 	/*2월비과세국외근로소득원화*/        
						9, 	/*2월비과세생산직근로자야근수당*/    
						20,	/*2월기타비과세내용*/                
						9,	/*2월기타비과세금액*/                
						6, 	/*3월비과세지급년월*/                
						9, 	/*3월비과세국외근로소득외화*/        
						9, 	/*3월비과세국외근로소득원화*/        
						9, 	/*3월비과세생산직근로자야근수당*/    
						20,	/*3월기타비과세내용*/                
						9,	/*3월기타비과세금액*/                
						6, 	/*4월비과세지급년월*/                
						9, 	/*4월비과세국외근로소득외화*/        
						9, 	/*4월비과세국외근로소득원화*/        
						9, 	/*4월비과세생산직근로자야근수당*/    
						20,	/*4월기타비과세내용*/                
						9,	/*4월기타비과세금액*/                
						6, 	/*5월비과세지급년월*/                
						9, 	/*5월비과세국외근로소득외화*/        
						9, 	/*5월비과세외근로소득원화*/          
						9, 	/*5월비과세국생산직근로자야근수당*/  
						20,	/*5월기타비과세내용*/                
						9,	/*5월기타비과세금액*/                
						6, 	/*6월비과세지급년월*/                
						9, 	/*6월비과세국외근로소득외화*/        
						9, 	/*6월비과세국외근로소득원화*/        
						9, 	/*6월비과세생산직근로자야근수당*/    
						20,	/*6월기타비과세내용*/                
						9,	/*6월기타비과세금액*/                
						6, 	/*7월비과세지급년월*/                
						9, 	/*7월비과세국외근로소득외화*/        
						9, 	/*7월비과세국외근로소득원화*/        
						9, 	/*7월비과세생산직근로자야근수당*/    
						20,	/*7월기타비과세내용*/                
						9,	/*7월기타비과세금액*/                
						6, 	/*8월비과세지급년월*/                
						9, 	/*8월비과세국외근로소득외화*/        
						9, 	/*8월비과세국외근로소득원화*/        
						9, 	/*8월비과세생산직근로자야근수당*/    
						20,	/*8월기타비과세내용*/                
						9,	/*8월기타비과세금액*/                
						6, 	/*9월비과세지급년월*/                
						9, 	/*9월비과세국외근로소득외화*/        
						9, 	/*9월비과세국외근로소득원화*/        
						9, 	/*9월비과세생산직근로자야근수당*/    
						20,	/*9월기타비과세내용*/                
						9,	/*9월기타비과세금액*/                
						6, 	/*10월비과세지급년월*/               
						9, 	/*10월비과세국외근로소득외화*/       
						9, 	/*10월비과세국외근로소득원화*/       
						9, 	/*10월비과세생산직근로자야근수당*/   
						20,	/*10월기타비과세내용*/               
						9,	/*10월기타비과세금액*/               
						6, 	/*11월비과세지급년월*/               
						9, 	/*11월비과세국외근로소득외화*/       
						9, 	/*11월비과세국외근로소득원화*/       
						9, 	/*11월비과세생산직근로자야근수당*/   
						20,	/*11월기타비과세내용*/               
						9,	/*11월기타비과세금액*/               
						6, 	/*12월비과세지급년월*/               
						9, 	/*12월비과세국외근로소득외화*/       
						9, 	/*12월비과세국외근로소득원화*/       
						9, 	/*12월비과세국생산직근로자야근수당*/ 
						20,	/*12월기타비과세내용*/               
						9,	/*12월기타비과세금액*/               
						9, 	/*년간국외근로소득외화계*/           
						9, 	/*년간국외근로소득원화계*/           
						9, 	/*년간생산직야간근로수당계*/         
						9, 	/*년간기타비과세계*/                 
						9, 	/*1월감면세액*/                      
						9,	/*1월소득세*/                        
						9,	/*1월주민세*/                        
						9,	/*1월농어촌특별세*/                  
						9,	/*1월연금보험*/                      
						9,	/*1월건강보험*/                      
						9,	/*1월고용보험*/                      
						9,	/*1월기부금*/                        
						9, 	/*2월감면세액*/                      
						9,	/*2월소득세*/                        
						9,	/*2월주민세*/                        
						9,	/*2월농어촌특별세*/                  
						9,	/*2월연금보험*/                      
						9,	/*2월건강보험*/                      
						9,	/*2월고용보험*/                      
						9,	/*2월기부금*/                        
						9, 	/*3월감면세액*/                      
						9,	/*3월소득세*/                        
						9,	/*3월주민세*/                        
						9,	/*3월농어촌특별세*/                  
						9,	/*3월연금보험*/                      
						9,	/*3월건강보험*/                      
						9,	/*3월고용보험*/                      
						9,	/*3월기부금*/                        
						9, 	/*4월감면세액*/                      
						9,	/*4월소득세*/                        
						9,	/*4월주민세*/                        
						9,	/*4월농어촌특별세*/                  
						9,	/*4월연금보험*/                      
						9,	/*4월건강보험*/                      
						9,	/*4월고용보험*/                      
						9,	/*4월기부금*/                        
						9, 	/*5월감면세액*/                      
						9,	/*5월소득세*/                        
						9,	/*5월주민세*/                        
						9,	/*5월농어촌특별세*/                  
						9,	/*5월연금보험*/                      
						9,	/*5월건강보험*/                      
						9,	/*5월고용보험*/                      
						9,	/*5월기부금*/                        
						9, 	/*6월감면세액*/                      
						9,	/*6월소득세*/                        
						9,	/*6월주민세*/                        
						9,	/*6월농어촌특별세*/                  
						9,	/*6월연금보험*/                      
						9,	/*6월건강보험*/                      
						9,	/*6월고용보험*/                      
						9,	/*6월기부금*/                        
						9, 	/*7월감면세액*/                      
						9,	/*7월소득세*/                        
						9,	/*7월주민세*/                        
						9,	/*7월농어촌특별세*/                  
						9,	/*7월연금보험*/                      
						9,	/*7월건강보험*/                      
						9,	/*7월고용보험*/                      
						9,	/*7월기부금*/                        
						9, 	/*8월감면세액*/                      
						9,	/*8월소득세*/                        
						9,	/*8월주민세*/                        
						9,	/*8월농어촌특별세*/                  
						9,	/*8월연금보험*/                      
						9,	/*8월건강보험*/                      
						9,	/*8월고용보험*/                      
						9,	/*8월기부금*/                        
						9, 	/*9월감면세액*/                      
						9,	/*9월소득세*/                        
						9,	/*9월주민세*/                        
						9,	/*9월농어촌특별세*/                  
						9,	/*9월연금보험*/                      
						9,	/*9월건강보험*/                      
						9,	/*9월고용보험*/                      
						9,	/*9월기부금*/                        
						9, 	/*10월감면세액*/                     
						9,	/*10월소득세*/                       
						9,	/*10월주민세*/                       
						9,	/*10월농어촌특별세*/                 
						9,	/*10월연금보험*/                     
						9,	/*10월건강보험*/                     
						9,	/*10월고용보험*/                     
						9,	/*10월기부금*/                       
						9, 	/*11월감면세액*/                     
						9,	/*11월소득세*/                       
						9,	/*11월주민세*/                       
						9,	/*11월농어촌특별세*/                 
						9,	/*11월연금보험*/                     
						9,	/*11월건강보험*/                     
						9,	/*11월고용보험*/                     
						9,	/*11월기부금*/                       
						9, 	/*12월감면세액*/                     
						9,	/*12월소득세*/                       
						9,	/*12월주민세*/                       
						9,	/*12월농어촌특별세*/                 
						9,	/*12월연금보험*/                     
						9,	/*12월건강보험*/                     
						9, 	/*12월고용보험*/                     
						9,	/*12월기부금*/                       
						9,	/*년간소득세계*/                     
						9,	/*년간주민세계*/                     
						9,	/*년간농특세계*/                     
						9,	/*년간연금보험계*/                   
						9,	/*년간건강보험계*/                   
						9,	/*년간고용보험계*/                   
						9,  /*년간기부금계*/                     
						1,	/*진행상태*/ 
						8   /*작성일자*/
         }; 
				
				int[] intArrCN2 = new int[]{ 

					  -1,         /*귀속연도*/                        
						-1,         /*사번*/                            
						-1,         /*성명*/                            
						-1,         /*주민등록번호*/                    
						 0,         /*공제대상가족수*/                  
						-1,         /*1월지급년월*/                     
						 0,         /*1월급여액*/                       
						 0,         /*1월상여액*/                       
						 0,         /*1월인정상여*/                     
						 0,         /*1월총급여계*/                     
						 0,         /*1월간이세액표에 의한 소득세*/     
						-1,         /*2월지급년월*/                     
						 0,         /*2월급여액*/                       
						 0,         /*2월상여액*/                       
						 0,         /*2월인정상여*/                     
						 0,         /*2월총급여계*/                     
						 0,         /*2월간이세액표에 의한 소득세*/     
						-1,         /*3월지급년월*/                     
						 0,         /*3월급여액*/                       
						 0,         /*3월상여액*/                       
						 0,         /*3월인정상여*/                     
						 0,         /*3월총급여계*/                     
						 0,         /*3월간이세액표에 의한 소득세*/     
						-1,         /*4월지급년월*/                     
						 0,         /*4월급여액*/                       
						 0,         /*4월상여액*/                       
						 0,         /*4월인정상여*/                     
						 0,         /*4월총급여계*/                     
						 0,         /*4월간이세액표에 의한 소득세*/     
						-1,         /*5월지급년월*/                     
						 0,         /*5월급여액*/                       
						 0,         /*5월상여액*/                       
						 0,         /*5월인정상여*/                     
						 0,         /*5월총급여계*/                     
						 0,         /*5월간이세액표에 의한 소득세*/     
						-1,         /*6월지급년월*/                     
						 0,         /*6월급여액*/                       
						 0,         /*6월상여액*/                       
						 0,         /*6월인정상여*/                     
						 0,         /*6월총급여계*/                     
						 0,         /*6월간이세액표에 의한 소득세*/     
						-1,         /*7월지급년월*/                     
						 0,         /*7월급여액*/                       
						 0,         /*7월상여액*/                       
						 0,         /*7월인정상여*/                     
						 0,         /*7월총급여계*/                     
						 0,         /*7월간이세액표에 의한 소득세*/     
						-1,         /*8월지급년월*/                     
						 0,         /*8월급여액*/                       
						 0,         /*8월상여액*/                       
						 0,         /*8월인정상여*/                     
						 0,         /*8월총급여계*/                     
						 0,         /*8월간이세액표에 의한 소득세*/     
						-1,         /*9월지급년월*/                     
						 0,         /*9월급여액*/                       
						 0,         /*9월상여액*/                       
						 0,         /*9월인정상여*/                     
						 0,         /*9월총급여계*/                     
						 0,         /*9월간이세액표에 의한 소득세*/     
						-1,         /*10월지급년월*/                    
						 0,         /*10월급여액*/                      
						 0,         /*10월상여액*/                      
						 0,         /*10월인정상여*/                    
						 0,         /*10월총급여계*/                    
						 0,         /*10월간이세액표에 의한 소득세*/    
						-1,         /*11월지급년월*/                    
						 0,         /*11월급여액*/                      
						 0,         /*11월상여액*/                      
						 0,         /*11월인정상여*/                    
						 0,         /*11월총급여계*/                    
						 0,         /*11월간이세액표에 의한 소득세*/    
						-1,         /*12월지급년월*/                    
						 0,         /*12월급여액*/                      
						 0,         /*12월상여액*/                      
						 0,         /*12월인정상여*/                    
						 0,         /*12월총급여계*/                    
						 0,         /*12월간이세액표에 의한 소득세*/    
						 0,					/*년간급여계*/                      
						 0,					/*년간상여계*/                      
						 0,					/*년간인정상여계*/                  
						 0,					/*년간총급여계*/                    
						 0,					/*년간간이세액표에의한소득세계*/    
						-1,         /*1월비과세지급년월*/               
						 0,         /*1월비과세국외근로소득외화*/       
						 0,         /*1월비과세국외근로소득원화*/       
						 0,         /*1월비과세생산직근로자야근수당*/   
						-1,         /*1월기타비과세내용*/               
						 0,         /*1월기타비과세금액*/               
						-1,         /*2월비과세지급년월*/               
						 0,         /*2월비과세국외근로소득외화*/       
						 0,         /*2월비과세국외근로소득원화*/       
						 0,         /*2월비과세생산직근로자야근수당*/   
						-1,         /*2월기타비과세내용*/               
						 0,         /*2월기타비과세금액*/               
						-1,         /*3월비과세지급년월*/               
						 0,         /*3월비과세국외근로소득외화*/       
						 0,         /*3월비과세국외근로소득원화*/       
						 0,         /*3월비과세생산직근로자야근수당*/   
						-1,         /*3월기타비과세내용*/               
						 0,         /*3월기타비과세금액*/               
						-1,         /*4월비과세지급년월*/               
						 0,         /*4월비과세국외근로소득외화*/       
						 0,         /*4월비과세국외근로소득원화*/       
						 0,         /*4월비과세생산직근로자야근수당*/   
						-1,         /*4월기타비과세내용*/               
						 0,         /*4월기타비과세금액*/               
						-1,         /*5월비과세지급년월*/               
						 0,         /*5월비과세국외근로소득외화*/       
						 0,         /*5월비과세외근로소득원화*/         
						 0,         /*5월비과세국생산직근로자야근수당*/ 
						-1,         /*5월기타비과세내용*/               
						 0,         /*5월기타비과세금액*/               
						-1,         /*6월비과세지급년월*/               
						 0,         /*6월비과세국외근로소득외화*/       
						 0,         /*6월비과세국외근로소득원화*/       
						 0,         /*6월비과세생산직근로자야근수당*/   
						-1,         /*6월기타비과세내용*/               
						 0,         /*6월기타비과세금액*/               
						-1,         /*7월비과세지급년월*/               
						 0,         /*7월비과세국외근로소득외화*/       
						 0,         /*7월비과세국외근로소득원화*/       
						 0,         /*7월비과세생산직근로자야근수당*/   
						-1,         /*7월기타비과세내용*/               
						 0,         /*7월기타비과세금액*/               
						-1,         /*8월비과세지급년월*/               
						 0,         /*8월비과세국외근로소득외화*/       
						 0,         /*8월비과세국외근로소득원화*/       
						 0,         /*8월비과세생산직근로자야근수당*/   
						-1,         /*8월기타비과세내용*/               
						 0,         /*8월기타비과세금액*/               
						-1,         /*9월비과세지급년월*/               
						 0,         /*9월비과세국외근로소득외화*/       
						 0,         /*9월비과세국외근로소득원화*/       
						 0,         /*9월비과세생산직근로자야근수당*/   
						-1,         /*9월기타비과세내용*/               
						 0,         /*9월기타비과세금액*/               
						-1,         /*10월비과세지급년월*/              
						 0,         /*10월비과세국외근로소득외화*/      
						 0,         /*10월비과세국외근로소득원화*/      
						 0,         /*10월비과세생산직근로자야근수당*/  
						-1,         /*10월기타비과세내용*/              
						 0,         /*10월기타비과세금액*/              
						-1,         /*11월비과세지급년월*/              
						 0,         /*11월비과세국외근로소득외화*/      
						 0,         /*11월비과세국외근로소득원화*/      
						 0,         /*11월비과세생산직근로자야근수당*/  
						-1,         /*11월기타비과세내용*/              
						 0,         /*11월기타비과세금액*/              
						-1,         /*12월비과세지급년월*/              
						 0,         /*12월비과세국외근로소득외화*/      
						 0,         /*12월비과세국외근로소득원화*/      
						 0,         /*12월비과세국생산직근로자야근수당*/
						-1,         /*12월기타비과세내용*/              
						 0,         /*12월기타비과세금액*/              
						 0,         /*년간국외근로소득외화계*/          
						 0,         /*년간국외근로소득원화계*/          
						 0,         /*년간생산직야간근로수당계*/        
						 0,         /*년간기타비과세계*/                
						 0,         /*1월감면세액*/                     
						 0,         /*1월소득세*/                       
						 0,         /*1월주민세*/                       
						 0,         /*1월농어촌특별세*/                 
						 0,         /*1월연금보험*/                     
						 0,         /*1월건강보험*/                     
						 0,         /*1월고용보험*/                     
						 0,         /*1월기부금*/                       
						 0,         /*2월감면세액*/                     
						 0,         /*2월소득세*/                       
						 0,         /*2월주민세*/                       
						 0,         /*2월농어촌특별세*/                 
						 0,         /*2월연금보험*/                     
						 0,         /*2월건강보험*/                     
						 0,         /*2월고용보험*/                     
						 0,         /*2월기부금*/                       
						 0,         /*3월감면세액*/                     
						 0,         /*3월소득세*/                       
						 0,         /*3월주민세*/                       
						 0,         /*3월농어촌특별세*/                 
						 0,         /*3월연금보험*/                     
						 0,         /*3월건강보험*/                     
						 0,         /*3월고용보험*/                     
						 0,         /*3월기부금*/                       
						 0,         /*4월감면세액*/                     
						 0,         /*4월소득세*/                       
						 0,         /*4월주민세*/                       
						 0,         /*4월농어촌특별세*/                 
						 0,         /*4월연금보험*/                     
						 0,         /*4월건강보험*/                     
						 0,         /*4월고용보험*/                     
						 0,         /*4월기부금*/                       
						 0,         /*5월감면세액*/                     
						 0,         /*5월소득세*/                       
						 0,         /*5월주민세*/                       
						 0,         /*5월농어촌특별세*/                 
						 0,         /*5월연금보험*/                     
						 0,         /*5월건강보험*/                     
						 0,         /*5월고용보험*/                     
						 0,         /*5월기부금*/                       
						 0,         /*6월감면세액*/                     
						 0,         /*6월소득세*/                       
						 0,         /*6월주민세*/                       
						 0,         /*6월농어촌특별세*/                 
						 0,         /*6월연금보험*/                     
						 0,         /*6월건강보험*/                     
						 0,         /*6월고용보험*/                     
						 0,         /*6월기부금*/                       
						 0,         /*7월감면세액*/                     
						 0,         /*7월소득세*/                       
						 0,         /*7월주민세*/                       
						 0,         /*7월농어촌특별세*/                 
						 0,         /*7월연금보험*/                     
						 0,         /*7월건강보험*/                     
						 0,         /*7월고용보험*/                     
						 0,         /*7월기부금*/                       
						 0,         /*8월감면세액*/                     
						 0,         /*8월소득세*/                       
						 0,         /*8월주민세*/                       
						 0,         /*8월농어촌특별세*/                 
						 0,         /*8월연금보험*/                     
						 0,         /*8월건강보험*/                     
						 0,         /*8월고용보험*/                     
						 0,         /*8월기부금*/                       
						 0,         /*9월감면세액*/                     
						 0,         /*9월소득세*/                       
						 0,         /*9월주민세*/                       
						 0,         /*9월농어촌특별세*/                 
						 0,         /*9월연금보험*/                     
						 0,         /*9월건강보험*/                     
						 0,         /*9월고용보험*/                     
						 0,         /*9월기부금*/                       
						 0,         /*10월감면세액*/                    
						 0,         /*10월소득세*/                      
						 0,         /*10월주민세*/                      
						 0,         /*10월농어촌특별세*/                
						 0,         /*10월연금보험*/                    
						 0,         /*10월건강보험*/                    
						 0,         /*10월고용보험*/                    
						 0,         /*10월기부금*/                      
						 0,         /*11월감면세액*/                    
						 0,         /*11월소득세*/                      
						 0,         /*11월주민세*/                      
						 0,         /*11월농어촌특별세*/                
						 0,         /*11월연금보험*/                    
						 0,         /*11월건강보험*/                    
						 0,         /*11월고용보험*/                    
						 0,         /*11월기부금*/                      
						 0,         /*12월감면세액*/                    
						 0,         /*12월소득세*/                      
						 0,         /*12월주민세*/                      
						 0,         /*12월농어촌특별세*/                
						 0,         /*12월연금보험*/                    
						 0,         /*12월건강보험*/                    
						 0,         /*12월고용보험*/                    
						 0,         /*12월기부금*/                      
						 0,         /*년간소득세계*/                    
						 0,         /*년간주민세계*/                    
						 0,         /*년간농특세계*/                    
						 0,         /*년간연금보험계*/                  
						 0,         /*년간건강보험계*/                  
						 0,         /*년간고용보험계*/                  
						 0,         /*년간기부금계*/                    
						-1,         /*진행상태*/
						-1					/*작성일자*/
				}; 

				for (int i=0; i<strArrCN.length; i++) { // set column column 
					switch ( intArrCN2[i] ) { 
						case -1 : dSet.addDataColumn(new GauceDataColumn(strArrCN[i], GauceDataColumn.TB_STRING, intArrCN[i])); break; 
						default : dSet.addDataColumn( new GauceDataColumn( strArrCN[i], GauceDataColumn.TB_DECIMAL, intArrCN[i], intArrCN2[i] ) ); break; 
					} 
				} 

				if (!GauceReq.isBuilderRequest()) {					
					StringBuffer sql = new StringBuffer();
						sql.append(" SELECT			\n");
						sql.append(" YYYY,			/*귀속연도*/		\n");
						sql.append(" EMPNO,			/*사번*/		\n");
						sql.append(" EMPNMK,		/*성명*/		\n");
						sql.append(" RESINO,		/*주민등록번호*/	\n");
						sql.append(" FAMCNT,		/*공제대상가족수*/	\n");
						sql.append(" INCYY01,	/*1월지급년월*/		\n");
						sql.append(" INC01001,	/*1월급여액*/		\n");
						sql.append(" INC01002,	/*1월상여액*/		\n");
						sql.append(" INC01003,	/*1월인정상여*/		\n");
						sql.append(" INC01004,	/*1월총급여계*/		\n");
						sql.append(" INC01005,	/*1월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY02,	/*2월지급년월*/		\n");
						sql.append(" INC02001,	/*2월급여액*/		\n");
						sql.append(" INC02002,	/*2월상여액*/		\n");
						sql.append(" INC02003,	/*2월인정상여*/		\n");
						sql.append(" INC02004,	/*2월총급여계*/		\n");
						sql.append(" INC02005,	/*2월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY03,	/*3월지급년월*/		\n");
						sql.append(" INC03001,	/*3월급여액*/		\n");
						sql.append(" INC03002,	/*3월상여액*/		\n");
						sql.append(" INC03003,	/*3월인정상여*/		\n");
						sql.append(" INC03004,	/*3월총급여계*/		\n");
						sql.append(" INC03005,	/*3월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY04,	/*4월지급년월*/		\n");
						sql.append(" INC04001,	/*4월급여액*/		\n");
						sql.append(" INC04002,	/*4월상여액*/		\n");
						sql.append(" INC04003,	/*4월인정상여*/		\n");
						sql.append(" INC04004,	/*4월총급여계*/		\n");
						sql.append(" INC04005,	/*4월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY05,	/*5월지급년월*/		\n");
						sql.append(" INC05001,	/*5월급여액*/		\n");
						sql.append(" INC05002,	/*5월상여액*/		\n");
						sql.append(" INC05003,	/*5월인정상여*/		\n");
						sql.append(" INC05004,	/*5월총급여계*/		\n");
						sql.append(" INC05005,	/*5월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY06,	/*6월지급년월*/		\n");
						sql.append(" INC06001,	/*6월급여액*/		\n");
						sql.append(" INC06002,	/*6월상여액*/		\n");
						sql.append(" INC06003,	/*6월인정상여*/		\n");
						sql.append(" INC06004,	/*6월총급여계*/		\n");
						sql.append(" INC06005,	/*6월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY07,	/*7월지급년월*/		\n");
						sql.append(" INC07001,	/*7월급여액*/		\n");
						sql.append(" INC07002,	/*7월상여액*/		\n");
						sql.append(" INC07003,	/*7월인정상여*/		\n");
						sql.append(" INC07004,	/*7월총급여계*/		\n");
						sql.append(" INC07005,	/*7월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY08,	/*8월지급년월*/		\n");
						sql.append(" INC08001,	/*8월급여액*/		\n");
						sql.append(" INC08002,	/*8월상여액*/		\n");
						sql.append(" INC08003,	/*8월인정상여*/		\n");
						sql.append(" INC08004,	/*8월총급여계*/		\n");
						sql.append(" INC08005,	/*8월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY09,	/*9월지급년월*/		\n");
						sql.append(" INC09001,	/*9월급여액*/		\n");
						sql.append(" INC09002,	/*9월상여액*/		\n");
						sql.append(" INC09003,	/*9월인정상여*/		\n");
						sql.append(" INC09004,	/*9월총급여계*/		\n");
						sql.append(" INC09005,	/*9월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY10,	/*10월지급년월*/	\n");
						sql.append(" INC10001,	/*10월급여액*/		\n");
						sql.append(" INC10002,	/*10월상여액*/		\n");
						sql.append(" INC10003,	/*10월인정상여*/	\n");
						sql.append(" INC10004,	/*10월총급여계*/	\n");
						sql.append(" INC10005,	/*10월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY11,	/*11월지급년월*/	\n");
						sql.append(" INC11001,	/*11월급여액*/		\n");
						sql.append(" INC11002,	/*11월상여액*/		\n");
						sql.append(" INC11003,	/*11월인정상여*/	\n");
						sql.append(" INC11004,	/*11월총급여계*/	\n");
						sql.append(" INC11005,	/*11월간이세액표에 의한 소득세*/\n");
						sql.append(" INCYY12,	/*12월지급년월*/	\n");
						sql.append(" INC12001,	/*12월급여액*/		\n");
						sql.append(" INC12002,	/*12월상여액*/		\n");
						sql.append(" INC12003,	/*12월인정상여*/	\n");
						sql.append(" INC12004,	/*12월총급여계*/	\n");
						sql.append(" INC12005,	/*12월간이세액표에 의한 소득세*/\n");
						sql.append(" SINC001,	/*년간급여계*/		\n");
						sql.append(" SINC002,	/*년간상여계*/		\n");
						sql.append(" SINC003,	/*년간인정상여계*/	\n");
						sql.append(" SINC004,	/*년간총급여계*/	\n");
						sql.append(" SINC005,	/*년간간이세액표에의한소득세계*/\n");
						sql.append(" FREYY01,	/*1월비과세지급년월*/   \n");
						sql.append(" FRE01001,	/*1월비과세국외근로소득외화*/	 \n");
						sql.append(" FRE01002,	/*1월비과세국외근로소득원화*/    \n");
						sql.append(" FRE01003,	/*1월비과세생산직근로자야근수당*/\n");
						sql.append(" FRE01004,	/*1월기타비과세내용*/   \n");
						sql.append(" FRE01005,	/*1월기타비과세금액*/   \n");
						sql.append(" FREYY02,	/*2월비과세지급년월*/   \n");
						sql.append(" FRE02001,	/*2월비과세국외근로소득외화*/    \n");
						sql.append(" FRE02002,	/*2월비과세국외근로소득원화*/    \n");
						sql.append(" FRE02003,	/*2월비과세생산직근로자야근수당*/\n");
						sql.append(" FRE02004,	/*2월기타비과세내용*/   \n");
						sql.append(" FRE02005,	/*2월기타비과세금액*/   \n");
						sql.append(" FREYY03,	/*3월비과세지급년월*/   \n");
						sql.append(" FRE03001,	/*3월비과세국외근로소득외화*/    \n");
						sql.append(" FRE03002,	/*3월비과세국외근로소득원화*/    \n");
						sql.append(" FRE03003,	/*3월비과세생산직근로자야근수당*/\n");
						sql.append(" FRE03004,	/*3월기타비과세내용*/   \n");
						sql.append(" FRE03005,	/*3월기타비과세금액*/   \n");
						sql.append(" FREYY04,	/*4월비과세지급년월*/   \n");
						sql.append(" FRE04001,	/*4월비과세국외근로소득외화*/    \n");
						sql.append(" FRE04002,	/*4월비과세국외근로소득원화*/    \n");
						sql.append(" FRE04003,	/*4월비과세생산직근로자야근수당*/\n");
						sql.append(" FRE04004,	/*4월기타비과세내용*/   \n");
						sql.append(" FRE04005,	/*4월기타비과세금액*/   \n");
						sql.append(" FREYY05,	/*5월비과세지급년월*/   \n");
						sql.append(" FRE05001,	/*5월비과세국외근로소득외화*/    \n");
						sql.append(" FRE05002,	/*5월비과세외근로소득원화*/      \n");
						sql.append(" FRE05003,	/*5월비과세국생산직근로자야근수당*/\n");
						sql.append(" FRE05004,	/*5월기타비과세내용*/   \n");
						sql.append(" FRE05005,	/*5월기타비과세금액*/   \n");
						sql.append(" FREYY06,	/*6월비과세지급년월*/   \n");
						sql.append(" FRE06001,	/*6월비과세국외근로소득외화*/    \n");
						sql.append(" FRE06002,	/*6월비과세국외근로소득원화*/    \n");
						sql.append(" FRE06003,	/*6월비과세생산직근로자야근수당*/\n");
						sql.append(" FRE06004,	/*6월기타비과세내용*/   \n");
						sql.append(" FRE06005,	/*6월기타비과세금액*/   \n");
						sql.append(" FREYY07,	/*7월비과세지급년월*/   \n");
						sql.append(" FRE07001,	/*7월비과세국외근로소득외화*/    \n");
						sql.append(" FRE07002,	/*7월비과세국외근로소득원화*/    \n");
						sql.append(" FRE07003,	/*7월비과세생산직근로자야근수당*/\n");
						sql.append(" FRE07004,	/*7월기타비과세내용*/   \n");
						sql.append(" FRE07005,	/*7월기타비과세금액*/   \n");
						sql.append(" FREYY08,	/*8월비과세지급년월*/   \n");
						sql.append(" FRE08001,	/*8월비과세국외근로소득외화*/\n");
						sql.append(" FRE08002,	/*8월비과세국외근로소득원화*/\n");
						sql.append(" FRE08003,	/*8월비과세생산직근로자야근수당*/\n");
						sql.append(" FRE08004,	/*8월기타비과세내용*/   \n");
						sql.append(" FRE08005,	/*8월기타비과세금액*/   \n");
						sql.append(" FREYY09,	/*9월비과세지급년월*/   \n");
						sql.append(" FRE09001,	/*9월비과세국외근로소득외화*/\n");
						sql.append(" FRE09002,	/*9월비과세국외근로소득원화*/\n");
						sql.append(" FRE09003,	/*9월비과세생산직근로자야근수당*/ \n");
						sql.append(" FRE09004,	/*9월기타비과세내용*/   \n");
						sql.append(" FRE09005,	/*9월기타비과세금액*/   \n");
						sql.append(" FREYY10,	/*10월비과세지급년월*/  \n");
						sql.append(" FRE10001,	/*10월비과세국외근로소득외화*/\n");
						sql.append(" FRE10002,	/*10월비과세국외근로소득원화*/\n");
						sql.append(" FRE10003,	/*10월비과세생산직근로자야근수당*/ \n");
						sql.append(" FRE10004,	/*10월기타비과세내용*/   \n");
						sql.append(" FRE10005,	/*10월기타비과세금액*/   \n");
						sql.append(" FREYY11,	/*11월비과세지급년월*/   \n");
						sql.append(" FRE01101,	/*11월비과세국외근로소득외화*/\n");
						sql.append(" FRE01102,	/*11월비과세국외근로소득원화*/\n");
						sql.append(" FRE01103,	/*11월비과세생산직근로자야근수당*/ \n");
						sql.append(" FRE01104,	/*11월기타비과세내용*/   \n");
						sql.append(" FRE01105,	/*11월기타비과세금액*/   \n");
						sql.append(" FREYY12,	/*12월비과세지급년월*/   \n");
						sql.append(" FRE12001,	/*12월비과세국외근로소득외화*/\n");
						sql.append(" FRE12002,	/*12월비과세국외근로소득원화*/\n");
						sql.append(" FRE12003,	/*12월비과세국생산직근로자야근수당*/\n");
						sql.append(" FRE12004,	/*12월기타비과세내용*/      \n");
						sql.append(" FRE12005,	/*12월기타비과세금액*/      \n");
						sql.append(" SFRE001,	/*년간국외근로소득외화계*/  \n");
						sql.append(" SFRE002,	/*년간국외근로소득원화계*/  \n");
						sql.append(" SFRE003,	/*년간생산직야간근로수당계*/\n");
						sql.append(" SFRE005,	/*년간기타비과세계*/	\n");
						sql.append(" COL01001,	/*1월감면세액*/		\n");
						sql.append(" COL01002,	/*1월소득세*/		\n");
						sql.append(" COL01003,	/*1월주민세*/		\n");
						sql.append(" COL01004,	/*1월농어촌특별세*/     \n");
						sql.append(" COL01005,	/*1월연금보험*/		\n");
						sql.append(" COL01006,	/*1월건강보험*/		\n");
						sql.append(" COL01007,	/*1월고용보험*/		\n");
						sql.append(" COL01008,	/*1월기부금*/		\n");
						sql.append(" COL02001,	/*2월감면세액*/		\n");
						sql.append(" COL02002,	/*2월소득세*/		\n");
						sql.append(" COL02003,	/*2월주민세*/		\n");
						sql.append(" COL02004,	/*2월농어촌특별세*/     \n");
						sql.append(" COL02005,	/*2월연금보험*/		\n");
						sql.append(" COL02006,	/*2월건강보험*/		\n");
						sql.append(" COL02007,	/*2월고용보험*/		\n");
						sql.append(" COL02008,	/*2월기부금*/		\n");
						sql.append(" COL03001,	/*3월감면세액*/		\n");
						sql.append(" COL03002,	/*3월소득세*/		\n");
						sql.append(" COL03003,	/*3월주민세*/		\n");
						sql.append(" COL03004,	/*3월농어촌특별세*/     \n");
						sql.append(" COL03005,	/*3월연금보험*/		\n");
						sql.append(" COL03006,	/*3월건강보험*/		\n");
						sql.append(" COL03007,	/*3월고용보험*/		\n");
						sql.append(" COL03008,	/*3월기부금*/		\n");
						sql.append(" COL04001,	/*4월감면세액*/		\n");
						sql.append(" COL04002,	/*4월소득세*/		\n");
						sql.append(" COL04003,	/*4월주민세*/		\n");
						sql.append(" COL04004,	/*4월농어촌특별세*/     \n");
						sql.append(" COL04005,	/*4월연금보험*/		\n");
						sql.append(" COL04006,	/*4월건강보험*/		\n");
						sql.append(" COL04007,	/*4월고용보험*/		\n");
						sql.append(" COL04008,	/*4월기부금*/		\n");
						sql.append(" COL05001,	/*5월감면세액*/		\n");
						sql.append(" COL05002,	/*5월소득세*/		\n");
						sql.append(" COL05003,	/*5월주민세*/		\n");
						sql.append(" COL05004,	/*5월농어촌특별세*/     \n");
						sql.append(" COL05005,	/*5월연금보험*/		\n");
						sql.append(" COL05006,	/*5월건강보험*/		\n");
						sql.append(" COL05007,	/*5월고용보험*/		\n");
						sql.append(" COL05008,	/*5월기부금*/		\n");
						sql.append(" COL06001,	/*6월감면세액*/		\n");
						sql.append(" COL06002,	/*6월소득세*/		\n");
						sql.append(" COL06003,	/*6월주민세*/		\n");
						sql.append(" COL06004,	/*6월농어촌특별세*/     \n");
						sql.append(" COL06005,	/*6월연금보험*/		\n");
						sql.append(" COL06006,	/*6월건강보험*/		\n");
						sql.append(" COL06007,	/*6월고용보험*/		\n");
						sql.append(" COL06008,	/*6월기부금*/		\n");
						sql.append(" COL07001,	/*7월감면세액*/		\n");
						sql.append(" COL07002,	/*7월소득세*/		\n");
						sql.append(" COL07003,	/*7월주민세*/		\n");
						sql.append(" COL07004,	/*7월농어촌특별세*/     \n");
						sql.append(" COL07005,	/*7월연금보험*/		\n");
						sql.append(" COL07006,	/*7월건강보험*/		\n");
						sql.append(" COL07007,	/*7월고용보험*/		\n");
						sql.append(" COL07008,	/*7월기부금*/		\n");
						sql.append(" COL08001,	/*8월감면세액*/		\n");
						sql.append(" COL08002,	/*8월소득세*/		\n");
						sql.append(" COL08003,	/*8월주민세*/		\n");
						sql.append(" COL08004,	/*8월농어촌특별세*/     \n");
						sql.append(" COL08005,	/*8월연금보험*/		\n");
						sql.append(" COL08006,	/*8월건강보험*/		\n");
						sql.append(" COL08007,	/*8월고용보험*/		\n");
						sql.append(" COL08008,	/*8월기부금*/		\n");
						sql.append(" COL09001,	/*9월감면세액*/		\n");
						sql.append(" COL09002,	/*9월소득세*/		\n");
						sql.append(" COL09003,	/*9월주민세*/		\n");
						sql.append(" COL09004,	/*9월농어촌특별세*/     \n");
						sql.append(" COL09005,	/*9월연금보험*/		\n");
						sql.append(" COL09006,	/*9월건강보험*/		\n");
						sql.append(" COL09007,	/*9월고용보험*/		\n");
						sql.append(" COL09008,	/*9월기부금*/		\n");
						sql.append(" COL10001,	/*10월감면세액*/	\n");
						sql.append(" COL10002,	/*10월소득세*/		\n");
						sql.append(" COL10003,	/*10월주민세*/		\n");
						sql.append(" COL10004,	/*10월농어촌특별세*/    \n");
						sql.append(" COL10005,	/*10월연금보험*/	\n");
						sql.append(" COL10006,	/*10월건강보험*/	\n");
						sql.append(" COL10007,	/*10월고용보험*/	\n");
						sql.append(" COL10008,	/*10월기부금*/		\n");
						sql.append(" COL11001,	/*11월감면세액*/	\n");
						sql.append(" COL11002,	/*11월소득세*/		\n");
						sql.append(" COL11003,	/*11월주민세*/		\n");
						sql.append(" COL11004,	/*11월농어촌특별세*/    \n");
						sql.append(" COL11005,	/*11월연금보험*/	\n");
						sql.append(" COL11006,	/*11월건강보험*/	\n");
						sql.append(" COL11007,	/*11월고용보험*/	\n");
						sql.append(" COL11008,	/*11월기부금*/		\n");
						sql.append(" COL12001,	/*12월감면세액*/	\n");
						sql.append(" COL12002,	/*12월소득세*/		\n");
						sql.append(" COL12003,	/*12월주민세*/		\n");
						sql.append(" COL12004,	/*12월농어촌특별세*/    \n");
						sql.append(" COL12005,	/*12월연금보험*/	\n");
						sql.append(" COL12006,	/*12월건강보험*/	\n");
						sql.append(" COL12007,	/*12월고용보험*/	\n");
						sql.append(" COL12008,	/*12월기부금*/		\n");
						sql.append(" SCOL002,	/*년간소득세계*/	\n");
						sql.append(" SCOL003,	/*년간주민세계*/	\n");
						sql.append(" SCOL004,	/*년간농특세계*/	\n");
						sql.append(" SCOL005,	/*년간연금보험계*/	\n");
						sql.append(" SCOL006,	/*년간건강보험계*/	\n");
						sql.append(" SCOL007,	/*년간고용보험계*/	\n");
						sql.append(" SCOL008,	/*년간기부금계*/	\n");
						sql.append(" PROSTS,	/*진행상태*/		\n");
						sql.append(" '"+str[2]+"' AS CURDT	/*귀속년도*/		\n");
						sql.append(" FROM PAYROLL.YCPERCOL	/*소득자별근로소득원천징수*/ \n");
						sql.append(" WHERE EMPNO = '"+str[0]+"' \n"); 
						sql.append(" AND YYYY = '"+str[1]+"' \n");

					logger.dbg.println(this,sql.toString());
/*********************************************************************************************/

					stmt = conn.getGauceStatement(sql.toString());
	 		    stmt.executeQuery(dSet);
				}
			} catch(Exception e) {
		  	logger.err.println(this,e);
		  } finally {
				if (stmt != null) try { stmt.close(); } catch (Exception e) {}
				if (conn != null) try {conn.close(true);} catch (Exception e) {}
			}

		  dSet.flush();
		  GauceRes.commit();
		  GauceRes.close();

		} catch (Exception e) {
			logger.err.println(this,e);
			logger.dbg.println(this,e.toString());
		} finally {
			loader.restoreService(service);
  	}
	}
}