<%@ page language="java" contentType="text/html;charset=euc-kr"%>
<b>★☆ 꼭! 읽어봐주세요!!!!! 업데이트 노트 [2012-02-17]</b>
<textarea id=patchNote style='width:850;height:300;overflow-y:auto;background:white;border:1 solid 	#9D9C9C;display:;position:relative;padding:8px;line-height:18px'>
[2013-09-05]
	1)[접수조회] 조회조건 추가/ 컬럼속성 별 Sorting View적용 / 엑셀추가
	2)[현장명 조회팝업]  컬럼속성 별 Sorting View적용
	3)[견적조회] 조회조건 추가/ 컬럼속성 별 Sorting View적용
	4)[품의조회] 조회조건 추가/ 엑셀추가
	5)[발주조회] 조회조건 추가/ 엑셀추가
	6)[검수조회] 조회조건 추가/ 엑셀추가	
	7)[발주조회] 조회조건 추가/ 엑셀추가		

[2013-09-04]
	1)[청구조회] 조회조건 추가/ 컬럼속성 별 Sorting View적용 / 엑셀추가
	2)[청구조회_관리자] 신규메뉴생성
	
[2013-07-17]
	1)[견적의뢰] 컬럼속성 별 Sorting View적용 / 분할 견적의뢰 프로세스 확인
	2)[품의작성] 품의전자결재 반려 건 조회/재상신 가능하게 수정

[2013-07-16]
	1)[검수정산] 컬럼 속성 점검 및 테스트 완료
	2)[검수조회] 전자결재/기안/출력 업데이트

[2013-05-16]
	1)[청구접수] 전자결재 반려 건 재 상신 프로세스 추가.

[2013-05-13]
	1)[자재청구] 자재청구 삭제 가능 조건 수정(구매요청 ==>구매요청 & 요청결재반려)

[2013-04-23]
	1)[자재청구] 전자결재 반려 건 재 상신 프로세스 추가.
	2)[품의작성] 전자결재 반려 건 재 상신 프로세스 추가.
	
[2012-08-20]
	1)[발주조회] 검색조건 (청구번호, 품의번호) 추가.
	
[2012-07-12]
	1)[구매]-[자재구매]-[관리자]-[자재청구(기본)] 메뉴 신규 생성.
	2)[구매]-[자재구매]-[관리자]-[자재청구(첨부파일)] 메뉴 신규 생성.
	3)[구매]-[자재구매]-[관리자]-[견적의뢰(관리자)] 메뉴 신규 생성.
	4)[구매]-[자재구매]-[관리자]-[견적접수(관리자)] 메뉴 신규 생성.

[2012-06-29]
	1)[검수조회] 물품인수증 인쇄기능 추가

[2012-05-09]
	1)[견적접수] 품목 일괄선택 기능추가
		  견적완료 건 조회/수정 가능 함
		  견적금액 입력창 UI수정
		  견적금액 수정기능 추가
		  견적단가 일괄입력기능 추가
		  결정금액 입력창 UI수정
		  결정금액 수정기능 추가
		  결정단가 일괄입력기능 추가
						
[2012-04-27]
	1)[발주조회] 발주서 인쇄기능 추가

[2012-04-10]
	1)[발주서] 발주서 메뉴신규생성
	2)[발주조회] 발주조회 메뉴신규생성

[2012-04-04]
	1)[품의조회] 품의서 인쇄기능 추가

[2012-03-19]
	1)[검수전자결재_상신] 메뉴신규생성
	2)[검수전자결재_미결함] 메뉴신규생성
	
[2012-03-16]
	1)[검수정산] 메뉴신규생성
	2)[검수조회] 메뉴신규생성
	3)[검수정산][검수조회] 메뉴의 자세한 이용방법은 전산팀에 문의요망(02-3669-3933 대리 박경국)

[2012-03-07]
	1)[품의작성] 선급금,계약이행보증금,하자보수보증금=>부가세포함
	2)[품의작성] (증감비율)(견적품목별비고)항목추가. 화면 뷰수정.
	3)[품의조회] 선급금,계약이행보증금,하자보수보증금=>부가세포함
	4)[품의조회] (증감비율)(견적품목별비고)항목추가. 화면 뷰수정.
	5)[품의전자결재] 선급금,계약이행보증금,하자보수보증금=>부가세포함

[2012-03-06]
	1)[견적접수] (증감비율)(견적담당자)(마감일자)(특기사항) 항목추가. (도급계약명)조회조건삭제. 화면 뷰수정.
	2)[견적조회] (증감비율)(견적담당자)(마감일자)(특기사항) 항목추가. (도급계약명)조회조건삭제. 화면 뷰수정.

[2012-03-05]
	1)[견적의뢰] (의뢰담당자사번)(견적제출마감일자)(견적특기사항)(견적품목별비고) 항목추가.

[2012-02-28]
	1)[견적의뢰] 도급계약명 조회 폼 삭제, 화면 뷰 수정

[2012-02-27]
	1)[자재청구] 화면 뷰 수정, 화면설명 주석추가
	2)[청구접수] 도급계약명 조회 폼 삭제, 투입창고 입력 폼 추가, 접수특기사항 입력 폼 추가, 화면설명 주석추가
	3)[청구접수_전자결재] 접수특기사항 조회추가, 화면 뷰 수정, 결재일시 조회수정, 날짜 형식수정,결재의견추가
	4)[접수조회] 도급계약명 조회 폼 삭제, 접수특기사항 조회추가, 화면 뷰 수정, 날짜 형식수정,결재반려사유 조회추가

[2012-02-25]
	1)좌측 메뉴트리 재구성 
	2)[자재청구] 투입창고 입력 폼 추가
	3)[청구조회] 투입창고 입력 폼 추가
	3)첨부파일 용량 10M

[2012-02-20] 
	1)품의일자 저장 단계가 [견적접수]화면에서 [품의서작성]화면으로 변경

[2012-02-17]
	1)[품목마스터] 메뉴가 신설. 경로: 홈>구매>자재구매>코드관리>품목마스터


</textarea>