<%@ page language="java" contentType="text/html;charset=euc-kr"%>
<div align="right">Update:20140206</div>
<textarea id=patchNote style="width:408px;height:140px;overflow-y:auto;background:white;border:1px solid #9D9C9C; position:relative;padding:8px;text:10px;line-height:16px">
------------------- 2014-02-06 09:31 ---------------------

＊이제 메뉴의 중복 팝업이 가능합니다.
  메뉴트리를 더블클릭하면 해당 메뉴화면이 새창으로 열립니다.
  이제 동일한 메뉴화면이라도 계속해서 새창으로 열려
  전표 등록 등 유사 작업을 보다 원활히 할 수 있습니다.
   



------------------- 2014-01-19 16:45 ---------------------

＊ERP시스템이 이전 및 업데이트되었습니다.
  1. 새로운 데이터베이스와 서버로 이전이 완료되어,
    기존의 서버보다 더욱 안정적이고 보다 빠른 서비스가 
    가능하게 되었습니다.
  
  
  2. Web서버, Was서버, DB서버가 모두 이중화되어 있어
    불시의 장애에도 중단 없는 서비스가 가능하고
    부하 분산을 통해 보다 많은 처리가 가능합니다.
     
 
  3. UI(User Interface)가 일부 개선되었습니다.
    메인 화면을 보다 차분하고 안정감 있게 구성하였습니다.
    메뉴 이동 방식이 팝업으로 변경되었습니다.
    
    
  개선된 시스템환경을 바탕으로 보다 편리한 업무환경을
 제공하기 위해 노력하겠습니다. 불편하거나 궁금한 것이
 있으면 언제든지 전산팀으로 문의해주세요.
 감사합니다. *^^*




------------------- 2013-06-10 08:05 ---------------------

＊시스템 담당자가 변경되었습니다.
  회계 관련(ERP)  -> 이동훈 대리 
  인사 관련(EHR) -> 정하나 대리



------------------- 2012-02-13 08:05 ---------------------
＊메인 포털 페이지에 "부서 근태 현황"
 이 추가되었습니다. 
 로그인 사용자의 부서원의 오늘, 내일
 근태현황이 나타납니다.
 업무에 참고하시기 바랍니다.
 
 

------------------- 2011-12-13 15:37 ---------------------
＊메인 포털 /결재할 문서 영역에 
 인사시스템 결재 건이 추가되었습니다.
 12/15 오픈하는 신이사 시스템에서
 결재 건이 발생할 경우 표시됩니다.
 클릭하면 미결함 창으로 이동합니다.
 
 

------------------- 2011-12-02 09:46 ---------------------
＊메인 포털 알림 란에 "결재할 문서"가
 추가되었습니다. ERP내의 각 업무영역에
 전자결재 건이 발생할 경우 숫자로 표시
 되며, 클릭하면 미결함으로 이동합니다.
 
＊홈>결재할 문서의 종류
 정보: 중요정보문서의 배포,수신 등
 관광: 서비스 요청 등
 메뉴: 메뉴권한 요청
 
＊홈>환경설정>전자결재>통합결재함
  >미결함: 내가 결재할 차례인 문서
  >결재함: 내가 결재한 문서
  >기안함: 내가 기안한 문서
 
＊미결함에서 조회 후 해당 문서를 더블
 클릭하면 결재상세 창이 뜨고 '승인'
 할 수 있습니다.



------------------- 2011-09-26 15:26 ---------------------
＊"개인정보보호 따라하기"가 추가되었습
 니다.



------------------- 2011-09-26 08:00 ---------------------
＊ERP시스템이 업데이트되었습니다.
 우측|상단 아이콘을 클릭하시면 
 해당 업무 포털로 이동합니다.

 향후 업데이트되는 내용은 포털화면을
 통해 지속적으로 알려드리겠습니다.

 문의는 전산팀으로 해주세요.
 감사합니다. *^^*
</textarea>